{"total":10000,"limit":20,"offset":0,"item":[{"uri":"21b8dd1b-5c1e-489c-88fb-497363489a33","issued":"2024-06-11T15:46:20Z","versioncreated":"2024-06-11T15:46:20Z","headline":"Hannon and Rosallion ready for Notable Speech rematch","description_text":"Plenty of cause for optimism with St James’s Palace looming.","body_html":"<p>Richard Hannon believes the round mile at Ascot in the St James&rsquo;s Palace Stakes gives Rosallion a chance of turning the tables on his 2000 Guineas conqueror Notable Speech.</p><p>While Rosallion went to the Curragh and won the Irish equivalent, beating stablemate Haatem in a tight finish, he has a length and a half to make up on Charlie Appleby&rsquo;s runner.</p><p>However, Hannon feels he will have come forward again for his second run of the season with Notable Speech no longer holding a fitness edge, as he was having his fourth run within five months at Newmarket.</p><p>&ldquo;I think Ascot will suit us an awful lot more than Newmarket, we were having our first run of the season, he obviously improved for that first run big time in the Irish Guineas and he will have come on again,&rdquo; Hannon told Unibet.</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">FROM THE ALL-WEATHER TO GUINEAS GLORY! &#128153;</p><p>Notable Speech wins the Qipco 2000 Guineas Stakes for William Buick and Charlie Appleby &#127942;<a href=\"https://twitter.com/hashtag/ITVRacing?src=hash&amp;ref_src=twsrc%5Etfw\">#ITVRacing</a> | <a href=\"https://twitter.com/godolphin?ref_src=twsrc%5Etfw\">@godolphin</a> <a href=\"https://t.co/KzjhEc2yPf\">pic.twitter.com/KzjhEc2yPf</a></p><p>&mdash; ITV Racing (@itvracing) <a href=\"https://twitter.com/itvracing/status/1786768866195959829?ref_src=twsrc%5Etfw\">May 4, 2024</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>&ldquo;Coming round a bend, quickening off a bend, hopefully you will see him be potent. I can&rsquo;t think there&rsquo;s many horses around that will match him for a turn of foot.</p><p>&ldquo;Sat swinging off that Ascot bend, waiting to press the button is how I&rsquo;ve thought of it and hopefully that&rsquo;s what happens but there&rsquo;s no doubt Charlie&rsquo;s horse is a really good horse.</p><p>&ldquo;My eye was drawn to our horse in the Guineas and I just thought he&rsquo;d win the way he was travelling and I couldn&rsquo;t believe he got beat, but when you watch the replay on the far side you see Charlie&rsquo;s horse and he never looked like getting beat which is a huge worry. He&rsquo;s an extremely good horse.</p><!-- EMBED START PA Quote --><figure><div class=\"pa-embed\" data-type=\"quote\" data-quote=\"I have no temptation to run him over a mile and a quarter - unless Sheikh Obaid does and then it's a different question - but to me he's an out-and-out miler\" data-source=\"Richard Hannon on Rosallion\"></div><script async src=\"//content-embed.pressassociation.com/embeds.js\" charset=\"utf-8\"></script></figure><!-- EMBED END PA Quote --><p>&ldquo;I&rsquo;d love to think we can beat him but he looked pretty good in the Guineas &ndash; and I know we have a really good horse, they are two top-class horses. I&rsquo;d love to think we could beat him.&rdquo;</p><p>As for the future Hannon sees no reason to step him up in trip for now and mooted a possible venture to the Breeders&rsquo; Cup.</p><p>He said: &ldquo;I have no temptation to run him over a mile and a quarter &ndash; unless Sheikh Obaid does and then it&rsquo;s a different question &ndash; but to me he&rsquo;s an out-and-out miler.</p><p>&ldquo;I still don&rsquo;t think soft ground was why he got beat (at Doncaster last year), he should go on it, but bearing that in mind I&rsquo;m minded to run him now then have a break with the end of the year in mind which may include America, depending on what Sheikh Obaid wants to do. I don&rsquo;t think you&rsquo;ll see him in something like a QEII because of that ground factor.&rdquo;</p><!-- EMBED START Image --><figure id=\"embedded275917567\"><img src=\"//image.assets.pressassociation.io/v2/image/production/e778d03dc0ca5ac661eac1728e411bf2Y29udGVudHNlYXJjaGFwaSwxNzE4MjA1MjA1/2.75917567.jpg?w=640\" alt=\"Haatem won the Craven and has bene placed in two Classics\" data-title=\"bet365 Craven Meeting &ndash; Day Three &ndash; Newmarket Racecourse\" data-copyright-holder=\"PA Wire\" data-copyright-notice=\"PA Wire/PA Images\" data-credit=\"Bradley Collyer\" data-usage-terms=\"Use subject to restrictions. Editorial use only, no commercial use without prior consent from rights holder.\" srcset=\"https://image.assets.pressassociation.io/v2/image/production/e778d03dc0ca5ac661eac1728e411bf2Y29udGVudHNlYXJjaGFwaSwxNzE4MjA1MjA1/2.75917567.jpg?w=320 320w, https://image.assets.pressassociation.io/v2/image/production/e778d03dc0ca5ac661eac1728e411bf2Y29udGVudHNlYXJjaGFwaSwxNzE4MjA1MjA1/2.75917567.jpg?w=640 640w, https://image.assets.pressassociation.io/v2/image/production/e778d03dc0ca5ac661eac1728e411bf2Y29udGVudHNlYXJjaGFwaSwxNzE4MjA1MjA1/2.75917567.jpg?w=1280 1280w\" sizes=\"(max-width: 767px) 89vw, (max-width: 1000px) 54vw, (max-width: 1071px) 543px, 580px\"><figcaption>Haatem won the Craven and has bene placed in two Classics (Bradley Collyer/PA)</figcaption></figure><!-- EMBED END Image --><p>Irish Guineas runner-up Haatem is dropping in distance for the Jersey Stakes, when he will sport new colours having been bought by Wathnan Racing.</p><p>&ldquo;Haatem is an extremely good horse, I&rsquo;ve never seen a horse get so much love for finishing second, he really has a massive fan club now but I think he deserves it,&rdquo; said Hannon.</p><p>&ldquo;He deserves his day in the sun, of which I hope he&rsquo;ll have many more. Coming back to seven was an easy decision because there&rsquo;s not just Rosallion in the St James&rsquo;s Palace, there&rsquo;s Notable Speech and a few others, it&rsquo;ll be red hot.</p><p>&ldquo;Why not take the easier route? Ascot winners, whether Group Ones or not, they are in stature and achievement for your owners and your business, they are so important. I&rsquo;d love to see him win one.&rdquo;</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://image.assets.pressassociation.io/v2/image/production/88a1a49fb5b36b271fa4481f8b654e40Y29udGVudHNlYXJjaGFwaSwxNzE4MjAzNzM3/2.76321647.jpg?rect=0,387,5168,2907&ext=.jpg","mimetype":"image/jpg","height":2907,"width":5168}}}}},{"uri":"fa563fc0-2ed9-4108-8341-a351d0d0711d","issued":"2024-06-11T14:33:36Z","versioncreated":"2024-06-11T14:33:36Z","headline":"O’Brien happy with Ascot Gold Cup favourite Kyprios","description_text":"‘His first two runs were lovely, so we’re really looking forward to getting him there’.","body_html":"<p>Kyprios will lead Aidan O&rsquo;Brien&rsquo;s squad into battle at Royal Ascot next week as the star stayer bids to regain his Gold Cup crown.</p><p>The six-year-old dominated the division during an unbeaten campaign in 2022, with Gold Cup glory followed by victory in the Goodwood Cup and the Irish St Leger before a jaw-dropping 20-length demolition job in the Prix du Cadran.</p><p>A career-threatening injury restricted Kyprios to just two starts last season and he had to make do with the silver medal in both the Irish Leger and Ascot&rsquo;s Long Distance Cup, but having kicked off the new season with successive wins, he is odds-on to continue his resurgence.</p><!-- EMBED START Image --><figure id=\"embedded273491723\"><img src=\"//image.assets.pressassociation.io/v2/image/production/72ce2967179d94ae28f38330f697e94fY29udGVudHNlYXJjaGFwaSwxNzE4MjAxMjA3/2.73491723.jpg?w=640\" alt=\"Kyprios on the gallops at Ballydoyle \" data-title=\"Aidan O&rsquo;Brien Stable Visit Handout Photo\" data-copyright-holder=\"PA Media\" data-copyright-notice=\"PA Media\" data-credit=\"Tom Maher\" data-usage-terms=\"PICTURE DESK USE ONLY. NOTE TO EDITORS: This handout photo may only be used in for editorial reporting purposes for the contemporaneous illustration of events, things or the people in the image or facts mentioned in the caption. Reuse of the picture ma&hellip;\" srcset=\"https://image.assets.pressassociation.io/v2/image/production/72ce2967179d94ae28f38330f697e94fY29udGVudHNlYXJjaGFwaSwxNzE4MjAxMjA3/2.73491723.jpg?w=320 320w, https://image.assets.pressassociation.io/v2/image/production/72ce2967179d94ae28f38330f697e94fY29udGVudHNlYXJjaGFwaSwxNzE4MjAxMjA3/2.73491723.jpg?w=640 640w, https://image.assets.pressassociation.io/v2/image/production/72ce2967179d94ae28f38330f697e94fY29udGVudHNlYXJjaGFwaSwxNzE4MjAxMjA3/2.73491723.jpg?w=1280 1280w\" sizes=\"(max-width: 767px) 89vw, (max-width: 1000px) 54vw, (max-width: 1071px) 543px, 580px\"><figcaption>Kyprios on the gallops at Ballydoyle (Tom Maher/PA)</figcaption></figure><!-- EMBED END Image --><p>&ldquo;He went through a horrendous year the year before and we were very lucky to get him back racing last year, we didn&rsquo;t think we would ever get him racing but he ran two very good races,&rdquo; O&rsquo;Brien told Sky Sports Racing.</p><p>&ldquo;He&rsquo;s had a great winter and a great spring and everyone is very happy with him at the moment. His first two runs were lovely, so we&rsquo;re really looking forward to getting him there.</p><p>&ldquo;He was always the same horse at home from the time he was a two-year-old &ndash; he was all very laid-back, he travels and when he goes there (the front) he doesn&rsquo;t do much, he always did that.</p><p>&ldquo;We feel the Gold Cup is a very special race, it&rsquo;s a very unique race. Most horses with a staying pedigree would get nearly two miles, but when you go past that it goes into an unbelievably different territory altogether and very few really get it that well.</p><p>&ldquo;We always think when you have stayers with class it&rsquo;s a big help, but it&rsquo;s a difficult race to win and a very difficult race to find a horse for every year.&rdquo;</p><!-- EMBED START Image --><figure id=\"embedded272848784\"><img src=\"//image.assets.pressassociation.io/v2/image/production/3ae940fc32c4d28d3b134914fac3434aY29udGVudHNlYXJjaGFwaSwxNzE4MjAxMjQ1/2.72848784.jpg?w=640\" alt=\"Auguste Rodin will line up in the Prince of Wales's Stakes with a point to prove\" data-title=\"Dubai Duty Free Irish Derby Festival &ndash; Day Three &ndash; Curragh Racecourse\" data-copyright-holder=\"PA Archive\" data-copyright-notice=\"PA Archive/PA Images\" data-credit=\"Brian Lawless\" data-usage-terms=\"Use subject to restrictions. Editorial use only, no commercial use without prior consent from rights holder.\" srcset=\"https://image.assets.pressassociation.io/v2/image/production/3ae940fc32c4d28d3b134914fac3434aY29udGVudHNlYXJjaGFwaSwxNzE4MjAxMjQ1/2.72848784.jpg?w=320 320w, https://image.assets.pressassociation.io/v2/image/production/3ae940fc32c4d28d3b134914fac3434aY29udGVudHNlYXJjaGFwaSwxNzE4MjAxMjQ1/2.72848784.jpg?w=640 640w, https://image.assets.pressassociation.io/v2/image/production/3ae940fc32c4d28d3b134914fac3434aY29udGVudHNlYXJjaGFwaSwxNzE4MjAxMjQ1/2.72848784.jpg?w=1280 1280w\" sizes=\"(max-width: 767px) 89vw, (max-width: 1000px) 54vw, (max-width: 1071px) 543px, 580px\"><figcaption>Auguste Rodin will line up in the Prince of Wales&rsquo;s Stakes with a point to prove (Brian Lawless/PA)</figcaption></figure><!-- EMBED END Image --><p>O&rsquo;Brien also has high hopes for Auguste Rodin, who will look to make it third time lucky for the year in the Prince of Wales&rsquo;s Stakes.</p><p>A dual Derby hero and Irish Champion Stakes and Breeders&rsquo; Cup winner last year, the Deep Impact colt was bitterly disappointing in Dubai in March and had to give best to White Birch on his most recent outing in the Tattersalls Gold Cup, but O&rsquo;Brien is confident of an improved performance at Ascot.</p><p>&ldquo;He worked this morning and worked very well and with his two runs this year he was always working towards the Prince of Wales&rsquo;s,&rdquo; he added.</p><p>&ldquo;We were very happy with him the last day, the ground went a little bit soft and he had a bit of a wobble coming down the hill, but we were very happy and were using that race as a kind of stepping-stone on the way to Ascot.</p><p>&ldquo;We tactically didn&rsquo;t take the right decision in Dubai &ndash; we decided to drop in and take our time, then they only hacked and if you weren&rsquo;t handy you never got into it. Ryan (Moore) accepted it very early, which was the right thing because he knew he had no chance, but he came out of the race very well and we were very happy with his Curragh run other than he didn&rsquo;t win.&rdquo;</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Stunning! Justify filly Opera Singer wins the Group 1 Qatar Prix Marcel Boussac for Aidan O&rsquo;Brien and Ryan Moore at <a href=\"https://twitter.com/paris_longchamp?ref_src=twsrc%5Etfw\">@paris_longchamp</a> <a href=\"https://twitter.com/hashtag/WinAndYoureIN?src=hash&amp;ref_src=twsrc%5Etfw\">#WinAndYoureIN</a> <a href=\"https://t.co/xsGS7tdic2\">pic.twitter.com/xsGS7tdic2</a></p><p>&mdash; At The Races (@AtTheRaces) <a href=\"https://twitter.com/AtTheRaces/status/1708465720428765617?ref_src=twsrc%5Etfw\">October 1, 2023</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>Henry Longfellow and Opera Singer are being readied for the St James&rsquo;s Palace and Coronation Stakes respectively.</p><p>Henry Longfellow is looking to bounce back after finishing eighth as favourite for the French 2000 Guineas, while Opera Singer is expected to take a big step forward in the Irish 1,000 Guineas on her belated seasonal debut following a spring setback.</p><p>&ldquo;Everything is well with him (Henry Longfellow) since the last day, in France we made the wrong decision tactically that we&rsquo;d drop him and there was no pace on and it just became very messy up the straight &ndash; every time Ryan tried to get out he couldn&rsquo;t get out and his chance was gone,&rdquo; said O&rsquo;Brien.</p><p>&ldquo;We felt it was a bit of a non-event, Ryan did as well and everything has been well with him. We&rsquo;re looking forward to seeing him in Ascot.</p><p>&ldquo;Opera Singer was only in full work probably five weeks before the Curragh, so we really couldn&rsquo;t expect her to run any better than she did &ndash; we didn&rsquo;t expect her to run that well really.</p><p>&ldquo;We were thinking of a nice run in mid-division and she&rsquo;d come on a lot for it, so she ran an absolute blinder and we think she&rsquo;s come forward plenty since then.&rdquo;</p><!-- EMBED START Image --><figure id=\"embedded273749001\"><img src=\"//image.assets.pressassociation.io/v2/image/production/897443baa11cc54143c5ee5f15e9c136Y29udGVudHNlYXJjaGFwaSwxNzE4MjAxMzg3/2.73749001.jpg?w=640\" alt=\"Continuous (right) winning the St Leger at Doncaster\" data-title=\"Betfred St Leger Festival &ndash; Betfred St Leger Stakes Day &ndash; Doncaster Racecourse\" data-copyright-holder=\"PA Archive\" data-copyright-notice=\"PA Archive/PA Images\" data-credit=\"Tim Goode\" data-usage-terms=\"Use subject to restrictions. Editorial use only, no commercial use without prior consent from rights holder.\" srcset=\"https://image.assets.pressassociation.io/v2/image/production/897443baa11cc54143c5ee5f15e9c136Y29udGVudHNlYXJjaGFwaSwxNzE4MjAxMzg3/2.73749001.jpg?w=320 320w, https://image.assets.pressassociation.io/v2/image/production/897443baa11cc54143c5ee5f15e9c136Y29udGVudHNlYXJjaGFwaSwxNzE4MjAxMzg3/2.73749001.jpg?w=640 640w, https://image.assets.pressassociation.io/v2/image/production/897443baa11cc54143c5ee5f15e9c136Y29udGVudHNlYXJjaGFwaSwxNzE4MjAxMzg3/2.73749001.jpg?w=1280 1280w\" sizes=\"(max-width: 767px) 89vw, (max-width: 1000px) 54vw, (max-width: 1071px) 543px, 580px\"><figcaption>Continuous (right) winning the St Leger at Doncaster (Tim Goode/PA)</figcaption></figure><!-- EMBED END Image --><p>Continuous, last season&rsquo;s St Leger winner and not seen since finishing fifth in the Prix de l&rsquo;Arc de Triomphe in October, is poised to make his comeback in the Hardwicke Stakes, but O&rsquo;Brien warned: &ldquo;We&rsquo;ve had him away (to work) twice, but he is a big, gross horse who did really mature from last year, so I think no matter what we do he&rsquo;s definitely going to improve for the run.&rdquo;</p><p>As ever the Ballydoyle handler will be well represented in the two-year-old races over the course of the five-day meeting.</p><p>Detailing some of his running plans, he said: &ldquo;We run Camille Pissaro in the Coventry, he won first time and got beat second time. Ryan thought he was green so we think he&rsquo;s going to come forward from that.</p><p>&ldquo;In the Queen Mary we run a filly called Heavens Gate, she won nicely at the Curragh over six furlongs last time and just got beat over five the first day. We&rsquo;re going back to five with her, it could be a little bit sharp but we&rsquo;ll see.</p><p>&ldquo;In the Norfolk we have a horse called Whistlejacket and in the Windsor Castle we have a horse called Treasure Isle. In the Albany we have a filly called Fairy Godmother, she won at Naas last time and we really like her, then in the Chesham we have a filly called Bedtime Story who won in Leopardstown.</p><p>&ldquo;The racing is very competitive in Ascot, but hopefully they&rsquo;ll run well. Obviously we like them all, we think they&rsquo;re very smart horses and they wouldn&rsquo;t be there if we didn&rsquo;t.&rdquo;</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://image.assets.pressassociation.io/v2/image/production/32c6fdad6d33c53dd492a6ed400c7b9eY29udGVudHNlYXJjaGFwaSwxNzE4MjAyNTU0/2.67455417.jpg?rect=0,556,5236,2945&ext=.jpg","mimetype":"image/jpg","height":2945,"width":5236}}}}},{"uri":"1644dcf6-7007-4fe5-8aa7-b5aa5eb78ba9","issued":"2024-06-11T13:45:52Z","versioncreated":"2024-06-11T13:45:52Z","headline":"Bryony Frost suffers broken collarbone in France","description_text":"Frost has been riding in France for Simon Munir and Isaac Souede since the start of May.","body_html":"<p>Bryony Frost is set for a spell on the sidelines after breaking her collarbone during a fall in France on Sunday.</p><p>Frost has been riding for owners Simon Munir and Isaac Souede, who are famed for their &lsquo;double green&rsquo; colours, since the start of May after opportunities on British proved less frequent in comparison to previous years.</p><p>She suffered the fall while riding at Le Lion D&rsquo;Angers, which left her in immediate distress. Munir has now confirmed the injury in a statement released on his official X account.</p><p>&ldquo;Unhappy to report that Bryony Frost has broken her collarbone as a result of her fall at Le Lion D&rsquo;Angers on Sunday,&rdquo; the statement read.</p><p>&ldquo;Wishing her a speedy recovery and looking forward for her to be back riding for Team Double Green very soon.&rdquo;</p><p>A timeline has not been given on Frost&rsquo;s return but she will be targeting a rapid recovery with the French jumps season still in full swing, where the Grade One-winning 29-year-old receives a weight allowance when competing against her male counterparts.</p><p>Frost recorded her first win since moving across the Channel, aboard Likata at Sable-sur-Sarthe on May 26.</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://image.assets.pressassociation.io/v2/image/production/6a0ee354e3d9ad737b589fd14686ec45Y29udGVudHNlYXJjaGFwaSwxNzE4MTk4MjQ4/2.71920013.jpg?rect=0,145,5760,3240&ext=.jpg","mimetype":"image/jpg","height":3240,"width":5760}}}}},{"uri":"02f5374c-c526-4039-b4c0-18e7961287f9","issued":"2024-06-11T13:19:07Z","versioncreated":"2024-06-11T13:19:07Z","headline":"Breeders’ Cup Classic ambitions on the agenda for City Of Troy","description_text":"York or Leopardstown could be next step for Derby hero after Sandown.","body_html":"<p>Aidan O&rsquo;Brien has outlined the Breeders&rsquo; Cup Classic as the long-term objective for his Coral-Eclipse-bound Derby hero City Of Troy.</p><p>Last season&rsquo;s champion juvenile may have failed to fire as an odds-on favourite for the 2000 Guineas at Newmarket on his three-year-old debut, but any notion he had not trained on was dismissed by a sensational display at Epsom earlier this month.</p><p>With his star colt being a son of American Triple Crown hero Justify, connections have long been of the opinion that he could prove just as effective on dirt as he is on turf, making him an obvious candidate in O&rsquo;Brien&rsquo;s quest to claim an elusive Breeders&rsquo; Cup Classic success.</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">&#127942; That's how you bounce back in style!</p><p>City of Troy wins the Betfred Derby<a href=\"https://twitter.com/hashtag/ITVRacing?src=hash&amp;ref_src=twsrc%5Etfw\">#ITVRacing</a> | <a href=\"https://twitter.com/hashtag/EpsomDerby?src=hash&amp;ref_src=twsrc%5Etfw\">#EpsomDerby</a> <a href=\"https://t.co/yKzYaTykeQ\">pic.twitter.com/yKzYaTykeQ</a></p><p>&mdash; ITV Racing (@itvracing) <a href=\"https://twitter.com/itvracing/status/1796929287850746276?ref_src=twsrc%5Etfw\">June 1, 2024</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>An early trip across the Atlantic for a first run on dirt in the Travers Stakes at Saratoga in late August had been mentioned as a possibility earlier in the year &ndash; and while that plan was ultimately shelved, with owners Coolmore instead targeting that race with Kentucky Derby runner-up and Belmont Stakes third Sierra Leone, O&rsquo;Brien remains keen on a Classic bid come the autumn.</p><p>&ldquo;The plan is for him to go the Eclipse, he seems to be well since Epsom and we&rsquo;re looking forward to the next day,&rdquo; the Ballydoyle handler told Sky Sports Racing.</p><p>&ldquo;The long-term plan is that he could go to America and they (owners) have the other horse for Saratoga in America for a race that City Of Troy was going to run in.</p><p>&ldquo;He was a little bit green in Epsom and we just felt that maybe he wasn&rsquo;t ready for that (America) yet. The lads are thinking he&rsquo;ll go to Sandown and he&rsquo;ll go to either York (Juddmonte International) or Leopardstown (Irish Champion Stakes) after that and then he could head out to America for the Classic.</p><p>&ldquo;We just thought he was a little bit babyish (to run in the Travers) and obviously when you go to America you need a lot of experience and you need to be ready for it.&rdquo;</p><!-- EMBED START Image --><figure id=\"embedded276384687\"><img src=\"//image.assets.pressassociation.io/v2/image/production/ba8ed30be26975f93daca38758a0403cY29udGVudHNlYXJjaGFwaSwxNzE4MTk2NzE5/2.76384687.jpg?w=640\" alt=\"City Of Troy on his way to Derby glory\" data-title=\"The Betfred Derby Festival &ndash; Derby Day &ndash; Epsom Downs Racecourse\" data-copyright-holder=\"PA Wire\" data-copyright-notice=\"PA Wire/PA Images\" data-credit=\"John Walton\" data-usage-terms=\"Use subject to restrictions. Editorial use only, no commercial use without prior consent from rights holder.\" srcset=\"https://image.assets.pressassociation.io/v2/image/production/ba8ed30be26975f93daca38758a0403cY29udGVudHNlYXJjaGFwaSwxNzE4MTk2NzE5/2.76384687.jpg?w=320 320w, https://image.assets.pressassociation.io/v2/image/production/ba8ed30be26975f93daca38758a0403cY29udGVudHNlYXJjaGFwaSwxNzE4MTk2NzE5/2.76384687.jpg?w=640 640w, https://image.assets.pressassociation.io/v2/image/production/ba8ed30be26975f93daca38758a0403cY29udGVudHNlYXJjaGFwaSwxNzE4MTk2NzE5/2.76384687.jpg?w=1280 1280w\" sizes=\"(max-width: 767px) 89vw, (max-width: 1000px) 54vw, (max-width: 1071px) 543px, 580px\"><figcaption>City Of Troy on his way to Derby glory (John Walton/PA)</figcaption></figure><!-- EMBED END Image --><p>Reflecting on his Derby victory, O&rsquo;Brien added: &ldquo;He&rsquo;d never been dropped in in a race, he&rsquo;d never raced around a bend and had never been anywhere like Epsom, which is very demanding at the best of times for seasoned horses, so it was probably incredible what he did.</p><p>&ldquo;Ryan (Moore) gave him a great ride, he changed legs going to the line and took off again. He just clicked into gear again going by the line and Ryan was afraid he wasn&rsquo;t going to get him pulled up!&rdquo;</p><p>With City Of Troy heading for Sandown on July 6, his stablemate Los Angeles &ndash; beaten six lengths into third place at Epsom &ndash; will get his chance to bid for Classic glory as the stable&rsquo;s number one hope in Irish Derby the previous weekend.</p><p>&ldquo;We were lucky to have Los Angeles for the Irish Derby and we thought he ran a very nice race (at Epsom),&rdquo; said O&rsquo;Brien.</p><p>&ldquo;We thought a mile and a half at the Curragh would suit him. He was ridden very forward at Epsom and still ran a massive race, so we felt he deserved his chance as first string wherever he was going to go next.&rdquo;</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://image.assets.pressassociation.io/v2/image/production/90f984ba82dc6a2dd66d6f249b564d5bY29udGVudHNlYXJjaGFwaSwxNzE4MTk2MTYx/2.76387293.jpg?rect=0,441,5408,3042&ext=.jpg","mimetype":"image/jpg","height":3042,"width":5408}}}}},{"uri":"39a111b2-1474-4218-b46d-649181f4a430","issued":"2024-06-11T12:57:23Z","versioncreated":"2024-06-11T12:57:23Z","headline":"Julie Harrington to step down from role as BHA chief executive","description_text":"Harrington will continue in her post until the end of 2024.","body_html":"<p>Julie Harrington is to step down from her role as chief executive of the British Horseracing Authority after four years in the role.</p><p>To facilitate a smooth changeover, Harrington has agreed to stay in the position until the end of the year, although she said she had made the decision to leave her post &ldquo;some time ago&rdquo;.</p><p>The BHA is already looking for a replacement for outgoing chair, Joe Saumarez Smith, who will step down in May 2025.</p><p>Harrington said: &ldquo;With so much now in place to develop and grow the Industry Strategy, which will secure a brighter future for British horseracing, it felt like the right time to move on and let someone else steer the sport through its next exciting phase.</p><p>&ldquo;It has been a huge privilege to lead the BHA during what has been a period of real change as the sport has developed and implemented shared strategies for a sustainable future, and an ability to speak with one united voice.</p><p>&ldquo;I love working in horseracing, it is an amazing sport to be involved in. I will always be a fan and you can expect to see me at the races in the years ahead. I am proud of the progress the industry has made over the past three years, especially in improving the governance structure, and I hope that racing&rsquo;s stakeholders will continue to work together cooperatively to attract new audiences, further improve the customer experience and grow the sport.</p><p>&ldquo;I am confident that if the sport continues to foster the sense of unity and shared purpose that we have developed over the past few years then great things can be achieved.</p><p>&ldquo;My future plans are likely to include a move to a varied non-executive career. Although I took the decision to stand down some time ago, I have agreed to stay on until the end of year to allow a smooth transition to a new CEO.</p><p>&ldquo;The BHA board is already engaged in the search for Joe&rsquo;s successor as chair and informing the board of my intentions now gives the nominations committee the opportunity to plan an orderly handover, consider the complementary skills of candidates and allow the new Chair to be part of the final stages of CEO recruitment.</p><p>&ldquo;British Horseracing is one of the cornerstones of our sporting and cultural heritage. I will be forever thankful to have had the opportunity to be a part of it, both during my tenures at Northern Racing, on the BHA board and most recently as CEO of the BHA. I wish it every success in the years to come.&rdquo;</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://content.assets.pressassociation.io/2020/08/11121529/84bc15d6-66b5-466e-a93a-3b9ae1c7e8f2.jpg?rect=0,0,1200,675&ext=.jpg","mimetype":"image/jpeg","height":675,"width":1200}}}}},{"uri":"e1aff413-7f72-49a6-8102-195664ccdf07","issued":"2024-06-11T12:49:56Z","versioncreated":"2024-06-11T12:49:56Z","headline":"Middleham Park aiming to put a ring on Ascot success","description_text":"Richard Hannon’s sprinter is looking for an elusive first Group win.","body_html":"<p>Connections believe popular colt Shouldvebeenaring has &ldquo;unfinished business&rdquo; in Pattern races as they target Royal Ascot glory in the Queen Elizabeth II Jubilee Stakes.</p><p>The four-year-old has been knocking on the door for Group-class triumphs ever since making the step up from Listed company after his victory in the King Charles II Stakes at Newmarket in May 2023.</p><p>His near-misses include a second in the Sandy Lane Stakes on his next run, before returning to Haydock last September to be beaten by a neck in the Sprint Cup behind Regional.</p><p>A third in the Group One Prix de la Foret over seven furlongs at ParisLongchamp followed in October, while more recently the Richard Hannon-trained colt was a nose behind Mill Stream at York on his penultimate start.</p><!-- EMBED START Image --><figure id=\"embedded273663551\"><img src=\"//image.assets.pressassociation.io/v2/image/production/10899e24208811d43df0a3d7d72d3a3eY29udGVudHNlYXJjaGFwaSwxNzE3NzY4ODI5/2.73663551.jpg?w=640\" alt=\"Shouldvebeenaring\" data-title=\"Betfair Sprint Cup Day &ndash; Haydock Park\" data-copyright-holder=\"PA Archive\" data-copyright-notice=\"PA Archive/PA Images\" data-credit=\"Tim Goode\" data-usage-terms=\"Use subject to restrictions. Editorial use only, no commercial use without prior consent from rights holder.\" srcset=\"https://image.assets.pressassociation.io/v2/image/production/10899e24208811d43df0a3d7d72d3a3eY29udGVudHNlYXJjaGFwaSwxNzE3NzY4ODI5/2.73663551.jpg?w=320 320w, https://image.assets.pressassociation.io/v2/image/production/10899e24208811d43df0a3d7d72d3a3eY29udGVudHNlYXJjaGFwaSwxNzE3NzY4ODI5/2.73663551.jpg?w=640 640w, https://image.assets.pressassociation.io/v2/image/production/10899e24208811d43df0a3d7d72d3a3eY29udGVudHNlYXJjaGFwaSwxNzE3NzY4ODI5/2.73663551.jpg?w=1280 1280w\" sizes=\"(max-width: 767px) 89vw, (max-width: 1000px) 54vw, (max-width: 1071px) 543px, 580px\"><figcaption>Shouldvebeenaring, right, has had several near-misses in Group company over the last 13 months (Tim Goode/PA)</figcaption></figure><!-- EMBED END Image --><p>That run gives his owners plenty of optimism regarding another strong performance at the Royal meeting, where Shouldvebeenaring aims to improve on his seventh-place finish in last year&rsquo;s renewal of the Commonwealth Cup.</p><p>&ldquo;You can imagine that slightly patient tactics at Ascot could work,&rdquo; said Tom Palin, of Middleham Park Racing.</p><p>&ldquo;He didn&rsquo;t disgrace himself by any stretch of the imagination in the Commonwealth Cup last year, I just think we were drawn on the wrong side, so there is a bit of unfinished business at Ascot.</p><p>&ldquo;But really his season revolves around the six-and-a-half-furlong French Group One (Prix Maurice de Gheest at Deauville in August) and going back to Haydock for that Sprint Cup, where we really do have unfinished business in that Group One against Regional.</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">What a run from SHOULDVEBEENARING! 2nd in the Group 2 Duke Of York Stakes beaten by the smallest of margins &#128141;&#129352;<a href=\"https://twitter.com/rhannonracing?ref_src=twsrc%5Etfw\">@rhannonracing</a><a href=\"https://twitter.com/hashtag/TeamMPR?src=hash&amp;ref_src=twsrc%5Etfw\">#TeamMPR</a></p><p><a href=\"https://t.co/rVribnOU7H\">pic.twitter.com/rVribnOU7H</a></p><p>&mdash; Middleham Park Racing (@MprUpdates) <a href=\"https://twitter.com/MprUpdates/status/1790755075767357919?ref_src=twsrc%5Etfw\">May 15, 2024</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>&ldquo;Those are probably his two Derbys for the year, but absolutely the Jubilee will be his next run and we&rsquo;re looking forward to seeing how that pans out.</p><p>&ldquo;If we have a bit of pace on our side, hopefully we can come and pick them up late on &ndash; and normally it&rsquo;s not a bad thing to do at Ascot.&rdquo;</p><p>Globetrotting Brave Emperor returns to British soil for the first time since finishing down the field in the Hampton Court Stakes at Royal Ascot last year.</p><p>Successes in France, Germany, Italy and Qatar have earned the Archie Watson-trained four-year-old an entry in the Queen Anne Stakes this time around.</p><p>Malc, trained by Richard Fahey, will renew his rivalry with Elite Status in the Commonwealth Cup at the same venue where he beat him by half a length when second in the Norfolk Stakes 12 months ago.</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">GROUP WINNER Brave Emperor wins the Group 2 Irish Thoroughbred Marketing Cup in Qatar &#127478;&#127462; under an excellent ride from <a href=\"https://twitter.com/Luke_Morris88?ref_src=twsrc%5Etfw\">@Luke_Morris88</a>. Well done to <a href=\"https://twitter.com/MprUpdates?ref_src=twsrc%5Etfw\">@MprUpdates</a> and to all the team at home! <a href=\"https://twitter.com/hashtag/winner?src=hash&amp;ref_src=twsrc%5Etfw\">#winner</a> <a href=\"https://twitter.com/hashtag/groupwinner?src=hash&amp;ref_src=twsrc%5Etfw\">#groupwinner</a> <a href=\"https://twitter.com/hashtag/qatar?src=hash&amp;ref_src=twsrc%5Etfw\">#qatar</a> <a href=\"https://twitter.com/hashtag/international?src=hash&amp;ref_src=twsrc%5Etfw\">#international</a> <a href=\"https://twitter.com/hashtag/saxongate?src=hash&amp;ref_src=twsrc%5Etfw\">#saxongate</a> <a href=\"https://t.co/pT3FGzpdQw\">pic.twitter.com/pT3FGzpdQw</a></p><p>&mdash; Archie Watson Racing (@Archie_Watson) <a href=\"https://twitter.com/Archie_Watson/status/1758816624805617935?ref_src=twsrc%5Etfw\">February 17, 2024</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>Middleham Park are also enthused by two-year-old Glorious Kitty, who came fourth on debut in the Marygate at York for Mick and David Easterby last month, as she makes her second career start in Berkshire.</p><p>Palin said of Brave Emperor: &ldquo;He is thoroughly deserving of a stab at these sorts of races.</p><p>&ldquo;He&rsquo;s earned his right to have a go the hard way by doing Listed races, Group Threes and Group Twos in far-flung places, so there&rsquo;s not a more deserving horse to roll the dice in one of these English Group Ones.</p><p>&ldquo;And as you saw in the Lockinge, it is a wide-open division, and who knows, he might be able to get loose rolling away at the front end in the same way Audience did and he might just stay there, we know he&rsquo;s a tough horse to go past.&rdquo;</p><p>On Malc, Palin added: &ldquo;He was second in the Norfolk last year, so he&rsquo;s got previous at Ascot.</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">A huge debut from GLORIOUS KITTY, finishing 4th in the Listed Marygate Stakes, going so close to picking up black-type&#128517;</p><p>She's going to give her owners plenty of fun this season!<a href=\"https://twitter.com/MickEasterby?ref_src=twsrc%5Etfw\">@MickEasterby</a> <a href=\"https://twitter.com/hashtag/TeamMPR?src=hash&amp;ref_src=twsrc%5Etfw\">#TeamMPR</a></p><p><a href=\"https://t.co/BlvFpSsx30\">pic.twitter.com/BlvFpSsx30</a></p><p>&mdash; Middleham Park Racing (@MprUpdates) <a href=\"https://twitter.com/MprUpdates/status/1791462914546704441?ref_src=twsrc%5Etfw\">May 17, 2024</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>&ldquo;He&rsquo;s had his little ailments at the end of his two-year-old career, but I felt the way the race panned out in the Carnarvon at Newbury, again we were just drawn this side and we were the best of anything drawn that side by quite a long way.</p><p>&ldquo;I know Elite Status looked mighty impressive that day and he was always held in high regard, but we did beat him at Ascot last year and I feel that if you change the draw, at least put us over that side, we would have definitely given Elite Status something to think about.</p><p>&ldquo;The way that Ascot pans out for the likes of Malc, just a little more patient tactics, I expect him to be quite a live 66-1 each-way shot.&rdquo;</p><p>Speaking about Glorious Kitty, he said: &ldquo;She will either go for the Queen Mary or the Albany. She ran fourth in the Marygate on debut, so she&rsquo;s a hugely exciting horse with Mick and Dave Easterby.&rdquo;</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://image.assets.pressassociation.io/v2/image/production/0cd7ebabcfbbd568da35730f2ce120c5Y29udGVudHNlYXJjaGFwaSwxNzE4MTg0OTEx/2.76180504.jpg?rect=0,204,4648,2614&ext=.jpg","mimetype":"image/jpg","height":2614,"width":4648}}}}},{"uri":"88eb2bf1-1bb7-4d54-8214-1ef58ce53b3f","issued":"2024-06-11T11:41:48Z","versioncreated":"2024-06-11T11:41:48Z","headline":"Porta Fortuna target could still hinge on Berkshire weather","description_text":"Coronation Stakes Plan A, but Commonwealth Cup will be considered on soft ground.","body_html":"<p>Donnacha O&rsquo;Brien is leaning towards the Coronation Stakes with 1000 Guineas runner-up Porta Fortuna, but could still be persuaded to run his star filly in the Commonwealth Cup at Royal Ascot.</p><p>Victory at the Royal meeting eluded the 25-year-old during his time as a jockey, but the daughter of Caravaggio provided the County Tipperary handler with his first success at the summer showpiece as a member of the training ranks when landing the Albany Stakes 12 months ago.</p><p>Since then, Porta Fortuna has gone on to scoop Group One glory in the Cheveley Park Stakes, as well as rattle the crossbar at the Breeders&rsquo; Cup, and she also came mightily close to providing the trainer with his first Classic when second at Newmarket.</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Royal Ascot winner number 8&#8419;0&#8419; for Frankie!</p><p>Porta Fortuna lands the Group 3 Albany Stakes for Donnacha O'Brien!<a href=\"https://t.co/kinXO8eMbV\">pic.twitter.com/kinXO8eMbV</a></p><p>&mdash; Champions Series (@ChampionsSeries) <a href=\"https://twitter.com/ChampionsSeries/status/1672237537090215938?ref_src=twsrc%5Etfw\">June 23, 2023</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>Although both a Group One winner and proven over the Commonwealth Cup track and trip, O&rsquo;Brien is keen to continue plying Porta Fortuna&rsquo;s trade over a mile, which could see a Royal Ascot rematch with Rowley Mile conqueror Elmalka and subsequent Irish 1,000 Guineas heroine Fallen Angel.</p><p>However, he is also keeping an eye on the weather forecasts and a wet week in Berkshire could easily see Porta Fortuna change tack and drop back to six furlongs.</p><p>O&rsquo;Brien said: &ldquo;Obviously, Porta Fortuna will be our main hope for Ascot and we&rsquo;re still undecided on Coronation or Commonwealth.</p><p>&ldquo;The ground will play a factor and there is some rain forecast. If they got some rain, then we would be more likely to go Commonwealth, but if it is good ground, then the Coronation would probably be more likely.</p><!-- EMBED START Image --><figure id=\"embedded273951701\"><img src=\"//image.assets.pressassociation.io/v2/image/production/8fa7dd76100d8725c9f106f11b24c31cY29udGVudHNlYXJjaGFwaSwxNzE4MTEzODI3/2.73951701.jpg?w=640\" alt=\"Porta Fortuna winning the Cheveley Park Stakes\" data-title=\"Cambridgeshire Meeting &ndash; Day Three &ndash; Newmarket Racecourse\" data-copyright-holder=\"PA Archive\" data-copyright-notice=\"PA Archive/PA Images\" data-credit=\"Tim Goode\" data-usage-terms=\"Use subject to restrictions. Editorial use only, no commercial use without prior consent from rights holder.\" srcset=\"https://image.assets.pressassociation.io/v2/image/production/8fa7dd76100d8725c9f106f11b24c31cY29udGVudHNlYXJjaGFwaSwxNzE4MTEzODI3/2.73951701.jpg?w=320 320w, https://image.assets.pressassociation.io/v2/image/production/8fa7dd76100d8725c9f106f11b24c31cY29udGVudHNlYXJjaGFwaSwxNzE4MTEzODI3/2.73951701.jpg?w=640 640w, https://image.assets.pressassociation.io/v2/image/production/8fa7dd76100d8725c9f106f11b24c31cY29udGVudHNlYXJjaGFwaSwxNzE4MTEzODI3/2.73951701.jpg?w=1280 1280w\" sizes=\"(max-width: 767px) 89vw, (max-width: 1000px) 54vw, (max-width: 1071px) 543px, 580px\"><figcaption>Porta Fortuna winning the Cheveley Park Stakes (Tim Goode/PA)</figcaption></figure><!-- EMBED END Image --><p>&ldquo;She&rsquo;s very straightforward and an easy filly to train, so it makes things a lot easier.</p><p>&ldquo;I keep swapping and changing in my head what the best place is to go with her. I would be leaning towards the Coronation but if the ground came up soft, then we will obviously think about dropping back in trip instead.&rdquo;</p><p>The young handler is set to have only a few runners over the course of the week, with Roscommon scorer Naval Force and the Niarchos family&rsquo;s Yosemite Valley the others from the O&rsquo;Brien stable who could cross the Irish Sea.</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Naval Force stays on best to land the <a href=\"https://twitter.com/IrishEBF_?ref_src=twsrc%5Etfw\">@IrishEBF_</a> Irish Stallion Farms EBF 3yo Spring Series Median Auction Race for Donnacha O'Brien &#127942; <a href=\"https://t.co/MUSZITw8e9\">pic.twitter.com/MUSZITw8e9</a></p><p>&mdash; Roscommon Racecourse (@RoscommonRaces) <a href=\"https://twitter.com/RoscommonRaces/status/1790071699792146868?ref_src=twsrc%5Etfw\">May 13, 2024</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>&ldquo;We have Native Force in the three-year-old handicap, the King George V Stakes,&rdquo; continued O&rsquo;Brien.</p><p>&ldquo;He won well at Roscommon first time out this year and I think he is a horse who will have a little squeak in that handicap.</p><p>&ldquo;The only other possible would be Yosemite Valley in the Queen Anne, but he&rsquo;s not guaranteed to go to the meeting.&rdquo;</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://image.assets.pressassociation.io/v2/image/production/09afe763f6b365e71b61c1ca0559d5e9Y29udGVudHNlYXJjaGFwaSwxNzE4MTEzNjI3/2.76082213.jpg?rect=0,125,4976,2799&ext=.jpg","mimetype":"image/jpg","height":2799,"width":4976}}}}},{"uri":"d76a5656-6f3a-4dfa-8315-65f61a248da2","issued":"2024-06-11T10:00:42Z","versioncreated":"2024-06-11T10:00:42Z","headline":"Ryan confident Washington can reach new heights at Royal Ascot","description_text":"‘I have no doubt he’s capable of being competitive at Group One level’.","body_html":"<p>Kevin Ryan is full of confidence that Washington Heights can mix it with the best sprinters around in the Queen Elizabeth II Jubilee Stakes at Royal Ascot.</p><p>The improving four-year-old beat Mill Stream in the Abernant Stakes on his reappearance and was just behind the same rival in a blanket finish to the Duke of York Stakes at the Dante meeting.</p><p>He will be having his first run at the highest level on Saturday week but Ryan, who has handled such speedsters as Brando, Glass Slippers and Hello Youmzain in recent seasons, knows exactly what is required.</p><p>&ldquo;I have no doubt he&rsquo;s capable of being competitive at Group One level,&rdquo; said Ryan.</p><!-- EMBED START PA Quote --><figure><div class=\"pa-embed\" data-type=\"quote\" data-quote=\"He&rsquo;s done all his serious work now and is right where I want him going into Ascot\" data-source=\"Kevin Ryan on Washington Heights\"></div><script async src=\"//content-embed.pressassociation.com/embeds.js\" charset=\"utf-8\"></script></figure><!-- EMBED END PA Quote --><p>&ldquo;He&rsquo;s done all his serious work now and is right where I want him going into Ascot.&rdquo;</p><p>Washington Heights is owned by Hambleton Racing and their racing manager Cosmo Charlton added: &ldquo;The owners of Washington Heights have enjoyed a great journey with him so far and are living every moment.</p><p>&ldquo;He&rsquo;ll have a great team at Ascot to support him for his Group One debut. Win, lose or draw, the day should make some more special memories for his owners.</p><p>&ldquo;Not much beats having a runner at Royal Ascot. Winning down there is something special, but we tend to find our owners have a great day whatever the result.&rdquo;</p><!-- EMBED START Image --><figure id=\"embedded268011311\"><img src=\"//image.assets.pressassociation.io/v2/image/production/b9f588c59a81d0254236e2ff34dda79cY29udGVudHNlYXJjaGFwaSwxNzE4MTg0Njk0/2.68011311.jpg?w=640\" alt=\"Tempus (light colours) has a good record at Ascot\" data-title=\"QIPCO King George Meeting &ndash; Saturday July 23rd\" data-copyright-holder=\"PA Archive\" data-copyright-notice=\"PA Archive/PA Images\" data-credit=\"John Walton\" data-usage-terms=\"Use subject to restrictions. Editorial use only, no commercial use without prior consent from rights holder.\" srcset=\"https://image.assets.pressassociation.io/v2/image/production/b9f588c59a81d0254236e2ff34dda79cY29udGVudHNlYXJjaGFwaSwxNzE4MTg0Njk0/2.68011311.jpg?w=320 320w, https://image.assets.pressassociation.io/v2/image/production/b9f588c59a81d0254236e2ff34dda79cY29udGVudHNlYXJjaGFwaSwxNzE4MTg0Njk0/2.68011311.jpg?w=640 640w, https://image.assets.pressassociation.io/v2/image/production/b9f588c59a81d0254236e2ff34dda79cY29udGVudHNlYXJjaGFwaSwxNzE4MTg0Njk0/2.68011311.jpg?w=1280 1280w\" sizes=\"(max-width: 767px) 89vw, (max-width: 1000px) 54vw, (max-width: 1071px) 543px, 580px\"><figcaption>Tempus (light colours) has a good record at Ascot (John Walton/PA)</figcaption></figure><!-- EMBED END Image --><p>Hambleton are due to have three runners through the meeting, with the Archie Watson pair of Tempus and Beamish also running.</p><p>Of Tempus, due to go in the Royal Hunt Cup again, Watson said: &ldquo;He is in great form and loves the straight track at Ascot. He has finished third in a Hunt Cup off 100 and seventh off 109. He is running off 96 this year and I hope can run another huge race if the race sets up well for him.&rdquo;</p><p>Beamish will run in the Copper Horse Handicap, and Watson said: &ldquo;Beamish is a talented stayer. I was very pleased with his first run for us at Newbury. That will have brought him forward off such a long break (544 days) and I hope he can be very competitive at Ascot.&rdquo;</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://image.assets.pressassociation.io/v2/image/production/a369e896cdff26e8e938f1c52bec973eY29udGVudHNlYXJjaGFwaSwxNzE4MTg0MTUy/2.75917247.jpg?rect=0,523,5854,3293&ext=.jpg","mimetype":"image/jpg","height":3293,"width":5854}}}}},{"uri":"6d10c87d-143a-4aa9-8d4a-38d7cf89f39c","issued":"2024-06-11T08:55:27Z","versioncreated":"2024-06-11T08:55:27Z","headline":"Soumillon to ride Big Rock and Blue Rose Cen at Royal Ascot","description_text":"Trainer Maurizio Guarnieri confirmed Soumillon would take over from the regular rider Aurelien Lemaitre due to his greater experience of Ascot.","body_html":"<p>Christophe Soumillon will ride both Big Rock and Blue Rose Cen at Royal Ascot next week.</p><p>Trainer Maurizio Guarnieri confirmed Soumillon would take over from the regular rider of the pair, Aurelien Lemaitre, due to his greater experience of Ascot and his excellent record in big races around the world.</p><p>Big Rock, a startling winner of the Queen Elizabeth II Stakes on Champions Day when trained by Christopher Head, disappointed on his seasonal reappearance in the Lockinge at Newbury when he had valid excuses and heads for the Queen Anne.</p><p>Blue Rose Cen, three times a winner in Group One company last season for Head, made a pleasing reappearance when beaten a little over two lengths in the Prix d&rsquo;Ispahan by Mqse De Sevigne and will run in the Prince of Wales&rsquo;s Stakes.</p><p>Soumillon&rsquo;s last Group One win in the UK came in the Coral-Eclipse on Vadeni in 2022.</p><!-- EMBED START Image --><figure id=\"embedded274238104\"><img src=\"//image.assets.pressassociation.io/v2/image/production/e3e31fb2e16f6515962b5be6d6cc2356Y29udGVudHNlYXJjaGFwaSwxNzE4MTgxOTA4/2.74238104.jpg?w=640\" alt=\"Soumillon will replace Aurelien Lemaitre, who won on Big Rock on Champions Day\" data-title=\"QIPCO British Champions Day &ndash; Ascot Racecourse &ndash; Saturday 21st October\" data-copyright-holder=\"PA Archive\" data-copyright-notice=\"PA Archive/PA Images\" data-credit=\"John Walton\" data-usage-terms=\"Use subject to restrictions. Editorial use only, no commercial use without prior consent from rights holder.\" srcset=\"https://image.assets.pressassociation.io/v2/image/production/e3e31fb2e16f6515962b5be6d6cc2356Y29udGVudHNlYXJjaGFwaSwxNzE4MTgxOTA4/2.74238104.jpg?w=320 320w, https://image.assets.pressassociation.io/v2/image/production/e3e31fb2e16f6515962b5be6d6cc2356Y29udGVudHNlYXJjaGFwaSwxNzE4MTgxOTA4/2.74238104.jpg?w=640 640w, https://image.assets.pressassociation.io/v2/image/production/e3e31fb2e16f6515962b5be6d6cc2356Y29udGVudHNlYXJjaGFwaSwxNzE4MTgxOTA4/2.74238104.jpg?w=1280 1280w\" sizes=\"(max-width: 767px) 89vw, (max-width: 1000px) 54vw, (max-width: 1071px) 543px, 580px\"><figcaption>Soumillon will replace Aurelien Lemaitre, who won on Big Rock on Champions Day (John Walton/PA)</figcaption></figure><!-- EMBED END Image --><p>Guarnieri told the PA news agency: &ldquo;Soumillon is going to ride them both, we&rsquo;ve decided.</p><p>&ldquo;Christophe is world class. I and the owners decided to change. I think he is a champion, it is just that.</p><p>&ldquo;He knows all the tracks, he knows Ascot very well and he has won Group One races everywhere so I think he is the best choice.&rdquo;</p><p>As for Big Rock&rsquo;s chances, they could be boosted by some forecast rain.</p><p>&ldquo;I hope the rain comes, that should help him,&rdquo; said Guarnieri.</p><p>&ldquo;He had a problem coming out of the stalls in the Lockinge, he went down on his knee, after that it was very difficult.</p><p>&ldquo;The ground was also not in his favour at Newbury but the main problem was the start, when you put your nose on the ground the race is compromised.</p><p>&ldquo;We know he likes Ascot but the ground was very heavy that day.&rdquo;</p><!-- EMBED START Image --><figure id=\"embedded273224582\"><img src=\"//image.assets.pressassociation.io/v2/image/production/c787d0d6132f9abb54c7936b6bc31a12Y29udGVudHNlYXJjaGFwaSwxNzE4MTgxOTcw/2.73224582.jpg?w=640\" alt=\"Blue Rose Cen (centre) endured a luckless run at Glorious Goodwood last summer\" data-title=\"Qatar Goodwood Festival 2023 &ndash; Day Three &ndash; Goodwood Racecourse\" data-copyright-holder=\"PA Archive\" data-copyright-notice=\"PA Archive/PA Images\" data-credit=\"Andrew Matthews\" data-usage-terms=\"Use subject to restrictions. Editorial use only, no commercial use without prior consent from rights holder.\" srcset=\"https://image.assets.pressassociation.io/v2/image/production/c787d0d6132f9abb54c7936b6bc31a12Y29udGVudHNlYXJjaGFwaSwxNzE4MTgxOTcw/2.73224582.jpg?w=320 320w, https://image.assets.pressassociation.io/v2/image/production/c787d0d6132f9abb54c7936b6bc31a12Y29udGVudHNlYXJjaGFwaSwxNzE4MTgxOTcw/2.73224582.jpg?w=640 640w, https://image.assets.pressassociation.io/v2/image/production/c787d0d6132f9abb54c7936b6bc31a12Y29udGVudHNlYXJjaGFwaSwxNzE4MTgxOTcw/2.73224582.jpg?w=1280 1280w\" sizes=\"(max-width: 767px) 89vw, (max-width: 1000px) 54vw, (max-width: 1071px) 543px, 580px\"><figcaption>Blue Rose Cen (centre) endured a luckless run at Glorious Goodwood last summer (Andrew Matthews/PA)</figcaption></figure><!-- EMBED END Image --><p>Blue Rose Cen pleased connections with her comeback against the boys and will run in traditionally one of the hottest races of the week.</p><p>&ldquo;I was happy with her performance in the d&rsquo;Ispahan. After so long off it is not so easy to come back in a Group One race against the older colts who had already run,&rdquo; said Guarnieri.</p><p>&ldquo;She finished off her race, the distance was maybe a little short so with an extra furlong I am confident she will run well.&rdquo;</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://image.assets.pressassociation.io/v2/image/production/aa847f69b550b2ff125732a3d68cf02cY29udGVudHNlYXJjaGFwaSwxNzE4MTgxNjc1/2.67828838.jpg?rect=0,65,5201,2926&ext=.jpg","mimetype":"image/jpg","height":2926,"width":5201}}}}},{"uri":"c3079561-7481-4d11-8fe2-19c09c816000","issued":"2024-06-10T16:38:54Z","versioncreated":"2024-06-10T16:38:54Z","headline":"Osborne fears handicapper now has Ouzo in his grip","description_text":"Eight-year-old has won on his last three starts, which has pushed his mark up to 106.","body_html":"<p>Jamie Osborne conceded &ldquo;success gets penalised&rdquo; as stable star Ouzo&rsquo;s career-high mark could be to his detriment on his return to British shores with Royal Ascot in mind.</p><p>The eight-year-old has scored on his last three starts, with his winning run beginning with a dead-heat alongside Marco Botti&rsquo;s Daysofourlives at the Berkshire track in September.</p><p>Ouzo headed to Dubai for the winter, as he had done the year before, and continued his rich vein of form by claiming the Lord North Handicap and Lord Glitters Handicap at Meydan in January and February respectively.</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">A fantastic ride abord Ouzo &ndash; and now the first female jockey to ride a winner at Meydan.</p><p>Many congrats, <a href=\"https://twitter.com/OsborneSaffie?ref_src=twsrc%5Etfw\">@OsborneSaffie</a> &#128079; <a href=\"https://twitter.com/RacingDubai?ref_src=twsrc%5Etfw\">@RacingDubai</a> <a href=\"https://twitter.com/osbornejamie?ref_src=twsrc%5Etfw\">@osbornejamie</a> <a href=\"https://t.co/moy6pXaPzX\">pic.twitter.com/moy6pXaPzX</a></p><p>&mdash; Racing TV (@RacingTV) <a href=\"https://twitter.com/RacingTV/status/1758549669834051930?ref_src=twsrc%5Etfw\">February 16, 2024</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>As a result, he has seen his mark shoot up to 106, which his trainer fears is too high for Ouzo to challenge for a fourth straight success at the Royal meeting.</p><p>The son of Charm Spirit is slated for the Royal Hunt Cup over the straight mile, but Osborne hinted at a possible alternative of stepping up to 10 furlongs in the Wolferton Stakes.</p><p>&ldquo;Sadly in this game, success gets penalised,&rdquo; Osborne said. &ldquo;He left the UK on 98 and I actually thought that he might struggle in Meydan off that, because he&rsquo;d been the year before off 94 and didn&rsquo;t manage to win.</p><p>&ldquo;He did very well out there, which is great, but we&rsquo;ve come back at 106! So, I can&rsquo;t imagine he&rsquo;s well-handicapped.</p><p>&ldquo;We&rsquo;ve gone through the process as normal of a mini break when he came back from Dubai, we&rsquo;ve built him back up and he&rsquo;s ready to go again and he will run again next week.</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Dead-heat! There's nothing to split Daysofourlives and Ouzo in a thriller at <a href=\"https://twitter.com/Ascot?ref_src=twsrc%5Etfw\">@Ascot</a>&hellip;<a href=\"https://twitter.com/OsborneSaffie?ref_src=twsrc%5Etfw\">@OsborneSaffie</a> <a href=\"https://twitter.com/SC_Cherchi?ref_src=twsrc%5Etfw\">@SC_Cherchi</a> <a href=\"https://t.co/e3Rh6qGtUT\">pic.twitter.com/e3Rh6qGtUT</a></p><p>&mdash; At The Races (@AtTheRaces) <a href=\"https://twitter.com/AtTheRaces/status/1700177995401416812?ref_src=twsrc%5Etfw\">September 8, 2023</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>&ldquo;He&rsquo;s obviously in the Hunt Cup and he will also have an entry in the Wolferton to potentially try a longer trip with him, going 10 furlongs.</p><p>&ldquo;I don&rsquo;t know which way we will go yet. I just think wherever he goes, I don&rsquo;t think he&rsquo;s a genuine 106 horse.</p><p>&ldquo;You don&rsquo;t tend to win many races, especially Royal Ascot races, if your handicap is up to your axles &ndash; and that&rsquo;s where I kind of see him.</p><p>&ldquo;It&rsquo;s great he&rsquo;s won his last three races, he&rsquo;s given the girls a lot of fun, but there&rsquo;s a price to pay for that and I suspect that through this summer we will pay that price.&rdquo;</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://image.assets.pressassociation.io/v2/image/production/100fc335a4f10f01bd125c35fb755192Y29udGVudHNlYXJjaGFwaSwxNzE4MTIxNDAy/2.67702605.jpg?rect=0,793,2084,1172&ext=.jpg","mimetype":"image/jpg","height":1172,"width":2084}}}}},{"uri":"546910fe-a330-4653-8b43-2f21164996fc","issued":"2024-06-10T15:29:35Z","versioncreated":"2024-06-10T15:29:35Z","headline":"Heaven buyers aiming big – from Royal Ascot to Australia","description_text":"‘He’s a horse with the profile and lack of miles on the clock to be a Melbourne Cup contender.’","body_html":"<p>Leading Royal Ascot contender A Piece Of Heaven will be having his first start for new connections when he runs next week.</p><p>The six-year-old had been the flag bearer of Barry Fitzgerald&rsquo;s yard but he has subsequently been bought by Jack Cantillon of Syndicates Racing to be sent into training with Joseph O&rsquo;Brien.</p><p>His new owners are targeting the Copper Horse Handicap won by Vauban last season before a potential crack at the Melbourne Cup.</p><p>&ldquo;I think what this horse did at Leopardstown was really underestimated. He was off a mark of 94 and the handicapper gave him 7lb,&rdquo; Cantillon told www.thorougbreddailynews.com.</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">BREAKING: Delighted to have bought leading Royal Ascot contender A Piece of Heaven for syndication &#8252;&#65039;<a href=\"https://t.co/08zeg0BqTi\">pic.twitter.com/08zeg0BqTi</a></p><p>&mdash; Syndicates.Racing (@SyndicatesHQ) <a href=\"https://twitter.com/SyndicatesHQ/status/1800149230948118799?ref_src=twsrc%5Etfw\">June 10, 2024</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>&ldquo;We looked at his stride and sectional analytics and both metrics pointed to a top-class performance being posted. Not only did he put in the performance, but he also vetted extremely well.</p><p>&ldquo;If he can continue on his upward trajectory, he&rsquo;s a horse with the profile and lack of miles on the clock to be a Melbourne Cup contender.</p><p>&ldquo;A Piece Of Heaven has been sent to one of Ireland&rsquo;s greatest trainers and a brilliant man to travel a horse in Joseph O&rsquo;Brien but I think Barry deserves huge credit by how well he has campaigned him thus far.</p><p>&ldquo;If&nbsp;the horse can achieve more in 2024 and beyond, which I think he can, I&rsquo;d really like Barry to get the credit that he deserves for what a brilliant job he has done in nurturing this horse&rsquo;s talents.&rdquo;</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://content.assets.pressassociation.io/2024/06/10144916/847c110c-c739-44a3-a976-b561debdb352.jpeg?rect=0,77,2048,1152&ext=.jpeg","mimetype":"image/jpeg","height":1152,"width":2048}}}}},{"uri":"8861a152-090e-404d-8d12-09d92b7f9c92","issued":"2024-06-10T14:47:23Z","versioncreated":"2024-06-10T14:47:23Z","headline":"Fabre plotting repeat route with Mqse De Sevigne","description_text":"Rothschild and Romanet targets en route to Arc swansong challenge.","body_html":"<p>Andre Fabre&rsquo;s Mqse De Sevigne will aim to add to her Group One tally at Deauville before ending her career with a crack at the Prix de l&rsquo;Arc de Triomphe.</p><p>The five-year-old won the Prix Rothschild over a mile and the Prix Jean Romanet over 10 furlongs last summer and secured a short-head verdict in the Prix d&rsquo;Ispahan last time out, having warmed up with a win in Listed company.</p><p>She will head to Deauville in the summer to try to win the same two races once more before stepping up to a mile and a half for the first time at ParisLongchamp.</p><p>Fabre said: &ldquo;We have some nice older horses this year, of course with Mqse De Sevigne. She will wait for Deauville, the Prix Rothschild (July 28) and the Prix Jean Romanet (August 18) and then the Arc.</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Mqse De Sevigne gets there!</p><p>A nail-biter ends with victory for Alexis Pouchin and Andre Fabre in the Group 1 Prix d'Ispahan&hellip; <a href=\"https://t.co/3BzTRQCWnB\">pic.twitter.com/3BzTRQCWnB</a></p><p>&mdash; At The Races (@AtTheRaces) <a href=\"https://twitter.com/AtTheRaces/status/1794727161812959580?ref_src=twsrc%5Etfw\">May 26, 2024</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>&ldquo;She&rsquo;s versatile over distances but I don&rsquo;t want to risk her over a mile and a half early in the season, until the Arc. We&rsquo;ve nothing to lose by running her in it then.&rdquo;</p><p>Fabre has entered seven in the Grand Prix de Saint-Cloud at the end of the month, with Junko and Pensee Du Jour, both owned by the Wertheimer brothers, very much in the mix.</p><p>&ldquo;Pensee Du Jour is in the Grand Prix de Saint-Cloud (June 30) and she&rsquo;s in at Longchamp in the Prix de Malleret (July 13) but she&rsquo;s likely to go for the Grand Prix,&rdquo; said Fabre.</p><!-- EMBED START PA Quote --><figure><div class=\"pa-embed\" data-type=\"quote\" data-quote=\"I've entered seven, so I've got a few to choose from in the Grand Prix\" data-source=\"Andre Fabre ahead of the Grand Prix de Saint-Cloud\"></div><script async src=\"//content-embed.pressassociation.com/embeds.js\" charset=\"utf-8\"></script></figure><!-- EMBED END PA Quote --><p>&ldquo;I think she&rsquo;s a stronger filly this year. Obviously, last year she had the scope to get better as an older mare and she&rsquo;s now that much stronger.</p><p>&ldquo;I&rsquo;ve entered seven, so I&rsquo;ve got a few to choose from in the Grand Prix.</p><p>&ldquo;One who is sure to go is Junko, in the same ownership, and I will try to run Sevenna&rsquo;s Knight in it, too. He looks a progressive horse over staying distances, so I want to see him over a shorter distance.&rdquo;</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">UNBEATEN! &#129351; &#129351; &#129351;</p><p>LOOK DE VEGA wins the Prix du Jockey Club at <a href=\"https://twitter.com/fgchantilly?ref_src=twsrc%5Etfw\">@fgchantilly</a> to take his record to 3 from 3. &#127467;&#127479;</p><p>How would he fare against City Of Troy?</p><p>&#127909; <a href=\"https://twitter.com/AtTheRaces?ref_src=twsrc%5Etfw\">@AtTheRaces</a></p><p><a href=\"https://t.co/kHo3KSZiPd\">pic.twitter.com/kHo3KSZiPd</a></p><p>&mdash; World Horse Racing (@WHR) <a href=\"https://twitter.com/WHR/status/1797280058874204641?ref_src=twsrc%5Etfw\">June 2, 2024</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>Last weekend, Fabre was denied a first Prix du Jockey Club win since 2015 as Look De Vega saw off his runners First Look and Sosie, who came home second and third behind the impressive winner.</p><p>&ldquo;I think they were both beaten by a very nice colt. I haven&rsquo;t quite decided what they will do. The third horse will go for the Grand Prix de Paris and First Look I don&rsquo;t know,&rdquo; said Fabre.</p><p>&ldquo;Sosie is a nice, big horse and will keep progressing throughout the year.&rdquo;</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://content.assets.pressassociation.io/2023/08/20173314/75d89d2f-d171-4e9e-8f49-6aca74b4ec30.png?rect=0,58,843,474&ext=.png","mimetype":"image/png","height":474,"width":843}}}}},{"uri":"dff33220-60ba-475c-bc3e-654945ee1396","issued":"2024-06-10T14:28:31Z","versioncreated":"2024-06-10T14:28:31Z","headline":"Gosdens to be boosted by new Royal Ascot Advocate","description_text":"Last year’s Queen Mary winner will switch from American trainer George Weaver.","body_html":"<p>Crimson Advocate will join John and Thady Gosden ahead of her bid for back-to-back Royal Ascot victories later this month.</p><p>The daughter of Nyquist gave American handler George Weaver one of the biggest days of his career when blazing a trail to deny Relief Rally in a thrilling Queen Mary Stakes in 2023 and is now on course for the King Charles III Stakes over the same track and trip on the opening day of the Royal meeting.</p><p>Although put in her place by Ascot rival Big Evs at the Breeders&rsquo; Cup, she will attempt to turn the tables on Mick Appleby&rsquo;s star sprinter when the flying filly returns to Berkshire looking to emulate Wesley Ward&rsquo;s Lady Aurelia by doing the same double.</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Thriller! American filly Crimson Advocate wins the Queen Mary for <a href=\"https://twitter.com/ljlmvel?ref_src=twsrc%5Etfw\">@ljlmvel</a> and George Weaver! <a href=\"https://twitter.com/hashtag/RoyalAscot?src=hash&amp;ref_src=twsrc%5Etfw\">#RoyalAscot</a> <a href=\"https://twitter.com/Ascot?ref_src=twsrc%5Etfw\">@Ascot</a> <a href=\"https://t.co/eZn8h0omXg\">pic.twitter.com/eZn8h0omXg</a></p><p>&mdash; At The Races (@AtTheRaces) <a href=\"https://twitter.com/AtTheRaces/status/1671512262576865282?ref_src=twsrc%5Etfw\">June 21, 2023</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>At Ascot, she will be a part of Qatar-based owners Wathnan Racing&rsquo;s burgeoning team for the summer showpiece and she will soon arrive at her new Newmarket home, having come through her final preparations Stateside by claiming Gulfstream&rsquo;s Roar Stakes last month.</p><p>Wathnan&rsquo;s US representative Case Clay said: &ldquo;So much credit goes to George Weaver for what he has done with the filly so far, even training her up to going to England. But once we get to England, it sure is nice to be involved with John and Thady.</p><p>&ldquo;She had her final breeze on Saturday morning at Keeneland in preparation for the King Charles III and she is going to fly to England on June 11.</p><p>&ldquo;Royal Ascot is the top tier of racing and she proved herself worthy last year for connections, so hopefully she can do what Lady Aurelia did when she won the King&rsquo;s Stand as a three-year-old filly.&rdquo;</p><!-- EMBED START Image --><figure id=\"embedded276295958\"><img src=\"//image.assets.pressassociation.io/v2/image/production/9f36ecbc63b83c88bd68a87c09447eb1Y29udGVudHNlYXJjaGFwaSwxNzE4MDI1Mjc0/2.76295958.jpg?w=640\" alt=\"John Gosden, along with son Thady, will train Crimson Advocate this summer\" data-title=\"Sandown Park Races &ndash; Thursday 23rd March\" data-copyright-holder=\"PA Wire\" data-copyright-notice=\"PA Wire/PA Images\" data-credit=\"John Walton\" data-usage-terms=\"Use subject to restrictions. Editorial use only, no commercial use without prior consent from rights holder.\" srcset=\"https://image.assets.pressassociation.io/v2/image/production/9f36ecbc63b83c88bd68a87c09447eb1Y29udGVudHNlYXJjaGFwaSwxNzE4MDI1Mjc0/2.76295958.jpg?w=320 320w, https://image.assets.pressassociation.io/v2/image/production/9f36ecbc63b83c88bd68a87c09447eb1Y29udGVudHNlYXJjaGFwaSwxNzE4MDI1Mjc0/2.76295958.jpg?w=640 640w, https://image.assets.pressassociation.io/v2/image/production/9f36ecbc63b83c88bd68a87c09447eb1Y29udGVudHNlYXJjaGFwaSwxNzE4MDI1Mjc0/2.76295958.jpg?w=1280 1280w\" sizes=\"(max-width: 767px) 89vw, (max-width: 1000px) 54vw, (max-width: 1071px) 543px, 580px\"><figcaption>John Gosden, along with son Thady, will train Crimson Advocate this summer (John Walton/PA)</figcaption></figure><!-- EMBED END Image --><p>Despite proven form over the course and distance, Crimson Advocate is a general 16-1 shot to strike for the second year running at the Royal meeting.</p><p>However, following her relocation from the States to Clarehaven, owners Wathnan Racing are hoping she can be a force on the European sprinting scene throughout the summer, with races like the Nunthorpe also on the agenda for later in the season.</p><p>&ldquo;There are more important five-furlong sprints in England in the summer and fall than there are in America,&rdquo; continued Clay.</p><p>&ldquo;So, whether that is the Nunthorpe or the King George (at Goodwood), there is just more of them over there, so we thought let&rsquo;s keep her over there for a little while and see what unfolds.&rdquo;</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://image.assets.pressassociation.io/v2/image/production/024ee3dcf78c28ce356d6151d47ffa40Y29udGVudHNlYXJjaGFwaSwxNzE4MDIxNTcx/2.72700438.jpg?rect=0,202,5379,3026&ext=.jpg","mimetype":"image/jpg","height":3026,"width":5379}}}}},{"uri":"e99d66aa-42a1-4542-acbe-c46d6588272d","issued":"2024-06-10T13:13:30Z","versioncreated":"2024-06-10T13:13:30Z","headline":"Sandown Charge still on the agenda for Live In The Dream","description_text":"Sprinter returned home bruised after Haydock stumble but is ‘not too sore’.","body_html":"<p>Live In The Dream will head to the Coral Charge at Sandown on Eclipse day next after returning from his disappointing Achilles Stakes showing at Haydock with bruising.</p><p>Adam West&rsquo;s Nunthorpe hero was a 5-4 favourite for the Listed event on Merseyside having gone close on his seasonal return at the track only two weeks previous.</p><p>However, he stumbled leaving the stalls and had to be picked off his nose by jockey Sean Kirrane, with West believing that is where the five-year-old suffered his knocks and ultimately put paid to any chance of winning the race.</p><!-- EMBED START Image --><figure id=\"embedded273447665\"><img src=\"//image.assets.pressassociation.io/v2/image/production/d52ff94ed4bab5c30d6151428c14a771Y29udGVudHNlYXJjaGFwaSwxNzE4MTA2MDMy/2.73447665.jpg?w=640\" alt=\"Connections of Live In The Dream after winning the Nunthorpe\" data-title=\"Sky Bet Ebor Festival 2023 &ndash; Day Three &ndash; York Racecourse\" data-copyright-holder=\"PA Archive\" data-copyright-notice=\"PA Archive/PA Images\" data-credit=\"Simon Marper\" data-usage-terms=\"Use subject to restrictions. Editorial use only, no commercial use without prior consent from rights holder.\" srcset=\"https://image.assets.pressassociation.io/v2/image/production/d52ff94ed4bab5c30d6151428c14a771Y29udGVudHNlYXJjaGFwaSwxNzE4MTA2MDMy/2.73447665.jpg?w=320 320w, https://image.assets.pressassociation.io/v2/image/production/d52ff94ed4bab5c30d6151428c14a771Y29udGVudHNlYXJjaGFwaSwxNzE4MTA2MDMy/2.73447665.jpg?w=640 640w, https://image.assets.pressassociation.io/v2/image/production/d52ff94ed4bab5c30d6151428c14a771Y29udGVudHNlYXJjaGFwaSwxNzE4MTA2MDMy/2.73447665.jpg?w=1280 1280w\" sizes=\"(max-width: 767px) 89vw, (max-width: 1000px) 54vw, (max-width: 1071px) 543px, 580px\"><figcaption>Connections of Live In The Dream after winning the Nunthorpe (Simon Marper/PA)</figcaption></figure><!-- EMBED END Image --><p>&ldquo;He&rsquo;s been checked out thoroughly and he&rsquo;s got a bit of bruising on his off-side and lower rib cage,&rdquo; said West.</p><p>&ldquo;He actually hit the deck quite hard (leaving the stalls) and he had grass stains up to his knees when he jumped, when he caught the stalls or maybe one of the other horses caught him with a foot down the off-side.</p><p>&ldquo;He&rsquo;s not too sore, but it would have been enough to scupper a bold show like we had hoped.</p><p>&ldquo;It&rsquo;s just unfortunate that these things happen in racing. The headwind wouldn&rsquo;t have helped but ultimately his confidence was shot &ndash; even though his class got him back to the front, you can&rsquo;t win a sprint race after falling on your nose at the gates.&rdquo;</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">BOMBSHELL in the Nunthorpe &#128064;</p><p>28/1 outsider Live In The Dream takes down the big guns with a stunning pillar to post success in the Group 1 <a href=\"https://twitter.com/coolmorestud?ref_src=twsrc%5Etfw\">@coolmorestud</a> Wootton Bassett Nunthorpe Stakes.</p><p>What a day for Adam West and <a href=\"https://twitter.com/sb_kirrane?ref_src=twsrc%5Etfw\">@sb_kirrane</a> &#128079;</p><p>Remarkable scenes on the Knavesmire! <a href=\"https://t.co/U7QyZtEYYE\">pic.twitter.com/U7QyZtEYYE</a></p><p>&mdash; Racing TV (@RacingTV) <a href=\"https://twitter.com/RacingTV/status/1695084479952359637?ref_src=twsrc%5Etfw\">August 25, 2023</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>With the injury not set to keep Live In The Dream on the sidelines for any significant time, West is keen to scrub a line through Haydock and continue with the course mapped out back to York for the defence of his Nunthorpe Stakes title in August.</p><p>That will see him head to Esher on July 6, where the son of Prince Of Lir will bid to go one better than his Scurry Stakes second over the course and distance back in 2022.</p><p>West continued: &ldquo;He will come through it and he will be fine. The plan will still be to go to the Coral Charge.</p><p>&ldquo;There is enough time to recover from that (before Sandown) but of course we will just take things sensibly.</p><p>&ldquo;We&rsquo;re hoping to go to Sandown and then on to York. It&rsquo;s racing unfortunately and sometimes things like Saturday happen.&rdquo;</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://image.assets.pressassociation.io/v2/image/production/e910006c5b2a292bce726ddd724e045cY29udGVudHNlYXJjaGFwaSwxNzE4MTA1NjE1/2.73447244.jpg?rect=0,483,4524,2545&ext=.jpg","mimetype":"image/jpg","height":2545,"width":4524}}}}},{"uri":"b524dcfe-a905-47be-b008-2af42acaf2d2","issued":"2024-06-10T12:47:51Z","versioncreated":"2024-06-10T12:47:51Z","headline":"Ambiente Friendly camp opt for Irish Derby bid","description_text":"‘We were very keen to keep him at a mile and a half and stay against his own age group.’","body_html":"<p>Ambiente Friendly will aim to go one better than at Epsom when he contests the Dubai Duty Free Irish Derby at the Curragh on June 30.</p><p>The James Fanshawe-trained colt shot to prominence with a startling performance in the Lingfield Derby Trial.</p><p>Ridden by Rab Havlin for the first time at Epsom, he travelled ominously well for much of the contest before a rejuvenated City Of Troy shot through on his inside and he came out a clear second best.</p><!-- EMBED START Image --><figure id=\"embedded9778295\"><img src=\"//content.assets.pressassociation.io/2024/06/01172131/c254c47a-b4a5-4e1e-87d3-94749b4e437c.jpg\" alt=\"Ambiente Friendly after finishing second in the Derby\" srcset=\"https://content.assets.pressassociation.io/2024/06/01172131/c254c47a-b4a5-4e1e-87d3-94749b4e437c.jpg 2646w, https://content.assets.pressassociation.io/2024/06/01172131/c254c47a-b4a5-4e1e-87d3-94749b4e437c.jpg?w=320 320w, https://content.assets.pressassociation.io/2024/06/01172131/c254c47a-b4a5-4e1e-87d3-94749b4e437c.jpg?w=640 640w, https://content.assets.pressassociation.io/2024/06/01172131/c254c47a-b4a5-4e1e-87d3-94749b4e437c.jpg?w=1280 1280w\" sizes=\"(max-width: 767px) 89vw, (max-width: 1000px) 54vw, (max-width: 1071px) 543px, 580px\"><figcaption>Ambiente Friendly after finishing second in the Derby (PA)</figcaption></figure><!-- EMBED END Image --><p>With Aidan O&rsquo;Brien&rsquo;s number one now heading for the Coral-Eclipse at Sandown, co-owner Tim Gredley explained that Ambiente Friendly will tackle 12 furlongs once more against his own age group.</p><p>He said: &ldquo;After the dust settled, we were very keen to keep him at a mile and a half and, as importantly, stay against his own age group. It was the only option really and I&rsquo;m really looking forward to it and I think the race will suit him.</p><p>&ldquo;We want to do what is right by the horse and the conditions of the Irish Derby seem a lot more favourable than going to the Eclipse.</p><!-- EMBED START PA Quote --><figure><div class=\"pa-embed\" data-type=\"quote\" data-quote=\"We think the gradients of the Curragh and conditions of the race will suit\" data-source=\"Tim Gredley\"></div><script async src=\"//content-embed.pressassociation.com/embeds.js\" charset=\"utf-8\"></script></figure><!-- EMBED END PA Quote --><p>&ldquo;They came and won our Derby and for the sport, it only seems fair to go and have a go over there. We think the gradients of the Curragh and conditions of the race will suit, so that is why we have made the decision to go there.&rdquo;</p><p>Ambiente Friendly, who needs to be supplemented to the list of entries, will once again be partnered by Havlin, with the colt&rsquo;s Epsom pilot playing a key role in discussions about the Irish Derby assignment.</p><p>Gredley added: &ldquo;Rab will ride and we all had a good chat this morning &ndash; Mr Fanshawe and I also spoke to Rab and Freddie Tylicki. We are all in unanimous agreement that we should go to Ireland.&rdquo;</p><p>Paddy Power have promoted Ambiente Friendly to 5-4 favourite for the Irish Derby, with Epsom third Los Angeles next best in the betting at 6-4 after being confirmed as an intended runner by O&rsquo;Brien.</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://image.assets.pressassociation.io/v2/image/production/8290c1e956a99ef3d022684df543634cY29udGVudHNlYXJjaGFwaSwxNzE4MTA4MDU0/2.76135369.jpg?rect=0,411,5081,2858&ext=.jpg","mimetype":"image/jpg","height":2858,"width":5081}}}}},{"uri":"0a2da8a3-2893-4c20-bf52-e9d519ac5db9","issued":"2024-06-10T11:30:55Z","versioncreated":"2024-06-10T11:30:55Z","headline":"Kinross out to make it third time lucky with Jubilee joy","description_text":"Ralph Beckett’s valiant veteran is joint-favourite for the Royal Ascot sprint.","body_html":"<p>It is all systems go for Kinross, as Ralph Beckett&rsquo;s evergreen stable stalwart gears up for his Royal Ascot return in the Queen Elizabeth II Jubilee Stakes on Saturday week.</p><p>Now seven, the son of Kingman has been a star performer for both his Kimpton Down handler and owner Marc Chan, winning at least two group events per year for the past three seasons.</p><p>He finished outside the top three only once in a typically-proficient 2023 campaign, winning at both Goodwood and York in the summer before suffering narrow reversals in his title defences in the Prix de la Foret and when last seen in the British Champions Sprint Stakes.</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">&#128079;&#128079;&#128079;&#128079;&#128079;&#128079;&#128079;&#128079;&#128079;&#128079;</p><p>The ever consistent KINROSS provides <a href=\"https://twitter.com/FrankieDettori?ref_src=twsrc%5Etfw\">@FrankieDettori</a> with a win in the Sky Bet City Of York Stakes in his final time at York. <a href=\"https://twitter.com/hashtag/ITVRacing?src=hash&amp;ref_src=twsrc%5Etfw\">#ITVRacing</a> | <a href=\"https://twitter.com/yorkracecourse?ref_src=twsrc%5Etfw\">@yorkracecourse</a> | <a href=\"https://twitter.com/RalphBeckett?ref_src=twsrc%5Etfw\">@RalphBeckett</a> <a href=\"https://t.co/6PuXDqBBNS\">pic.twitter.com/6PuXDqBBNS</a></p><p>&mdash; ITV Racing (@itvracing) <a href=\"https://twitter.com/itvracing/status/1695437876647837704?ref_src=twsrc%5Etfw\">August 26, 2023</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>A course and distance winner, Kinross is now being prepared for his third crack at the final Group One of the Royal meeting and, with him currently disputing favouritism for the six-furlong contest, connections are keen to see their leading light back on track in what appears an open renewal.</p><p>&ldquo;Everything is on schedule with Kinross and he&rsquo;s a seven-year-old now, so we will just take one race at a time and hope he is as good as he was last year,&rdquo; said Jamie McCalmont, the owner&rsquo;s racing manager.</p><p>&ldquo;He won&rsquo;t really be put to the test until he runs and he&rsquo;s not a horse who takes a lot of training. He certainly doesn&rsquo;t need any extra seasoning. I think he will improve from this run whatever happens.</p><p>&ldquo;It does look a very open race at this point.&rdquo;</p><!-- EMBED START Image --><figure id=\"embedded272850239\"><img src=\"//image.assets.pressassociation.io/v2/image/production/28ec5150e22612adf0d3045f226b733dY29udGVudHNlYXJjaGFwaSwxNzE4MTAzNjEy/2.72850239.jpg?w=640\" alt=\"Bold Discovery was back to his best at the Curragh last month\" data-title=\"Dubai Duty Free Irish Derby Festival &ndash; Day Three &ndash; Curragh Racecourse\" data-copyright-holder=\"PA Archive\" data-copyright-notice=\"PA Archive/PA Images\" data-credit=\"Brian Lawless\" data-usage-terms=\"Use subject to restrictions. Editorial use only, no commercial use without prior consent from rights holder.\" srcset=\"https://image.assets.pressassociation.io/v2/image/production/28ec5150e22612adf0d3045f226b733dY29udGVudHNlYXJjaGFwaSwxNzE4MTAzNjEy/2.72850239.jpg?w=320 320w, https://image.assets.pressassociation.io/v2/image/production/28ec5150e22612adf0d3045f226b733dY29udGVudHNlYXJjaGFwaSwxNzE4MTAzNjEy/2.72850239.jpg?w=640 640w, https://image.assets.pressassociation.io/v2/image/production/28ec5150e22612adf0d3045f226b733dY29udGVudHNlYXJjaGFwaSwxNzE4MTAzNjEy/2.72850239.jpg?w=1280 1280w\" sizes=\"(max-width: 767px) 89vw, (max-width: 1000px) 54vw, (max-width: 1071px) 543px, 580px\"><figcaption>Bold Discovery was back to his best at the Curragh last month (Brian Lawless/PA)</figcaption></figure><!-- EMBED END Image --><p>Chan &ndash; who has a 100 per cent record with his runners in the UK this season &ndash; is also set to be represented at Ascot by Jessica Harrington&rsquo;s Bold Discovery, who is poised for a step up to 10 furlongs in the Wolferton Stakes following a taking victory over a mile in the Curragh&rsquo;s Amethyst Stakes.</p><p>&ldquo;As long as the ground is not soft, Bold Discovery will run in the Wolferton on the opening day,&rdquo; continued McCalmont.</p><p>&ldquo;We think that is a good spot for him. He will be stretching out to a mile and a quarter again, but that is where he runs.&rdquo;</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://image.assets.pressassociation.io/v2/image/production/97035bfb60550215950d368feeabb1a3Y29udGVudHNlYXJjaGFwaSwxNzE4MTAzNDAz/2.73459398.jpg?rect=0,290,5169,2908&ext=.jpg","mimetype":"image/jpg","height":2908,"width":5169}}}}},{"uri":"941d0895-f05c-496b-9bfd-33e640d94704","issued":"2024-06-10T10:40:13Z","versioncreated":"2024-06-10T10:40:13Z","headline":"Al-Jehani hunting Royal Ascot success with Beshtani","description_text":"Qatari trainer has made a promising start at his new Newmarket base.","body_html":"<p>Overseas entries may be down at Royal Ascot this year, but Hamad Al-Jehani will add some international flavour when Epsom runner-up Beshtani becomes one of his first runners at the meeting.</p><p>The 35-year-old is a leading trainer in his native Qatar, winning the Qatar Guineas with Lil&rsquo; Frank and also landing the Qatar Derby for owners Wathnan Racing with Jeff Koons in December.</p><p>He has recently made the switch to Newmarket to oversee some of Wathnan&rsquo;s growing UK string, operating out of the lower yard of Tom Clover&rsquo;s Kremlin House Stable.</p><!-- EMBED START Image --><figure id=\"embedded9775461\"><img src=\"//content.assets.pressassociation.io/2024/05/31155914/ffda1032-9a5b-47b9-9d72-d106e8d5e37d.jpg\" alt=\"Hamad Al Jehani will saddle his first Royal Ascot runners next week \" srcset=\"https://content.assets.pressassociation.io/2024/05/31155914/ffda1032-9a5b-47b9-9d72-d106e8d5e37d.jpg 1037w, https://content.assets.pressassociation.io/2024/05/31155914/ffda1032-9a5b-47b9-9d72-d106e8d5e37d.jpg?w=320 320w, https://content.assets.pressassociation.io/2024/05/31155914/ffda1032-9a5b-47b9-9d72-d106e8d5e37d.jpg?w=640 640w, https://content.assets.pressassociation.io/2024/05/31155914/ffda1032-9a5b-47b9-9d72-d106e8d5e37d.jpg?w=1037 1037w\" sizes=\"(max-width: 767px) 89vw, (max-width: 1000px) 54vw, (max-width: 1071px) 543px, 580px\"><figcaption>Hamad Al Jehani will saddle his first Royal Ascot runners next week (PA)</figcaption></figure><!-- EMBED END Image --><p>Although still to saddle a winner in the early stages of his new venture, Al-Jehani almost made the perfect start at Epsom during the Derby Festival, where Beshtani was beaten a nose and Haunted Dream was a fast-finishing fourth following a less-than-ideal start.</p><p>Beshtani could get the chance to go one better than that Epsom near-miss when he lines up in the Royal Hunt Cup at the Royal meeting, where the four-year-old could be joined by stablemate Make Me King, who also has the option of the Buckingham Palace Stakes.</p><p>&ldquo;Hamad has obviously made a very good start and Beshtani running as he did at Epsom was a very good training performance,&rdquo; said Richard Brown, Wathnan&rsquo;s racing adviser.</p><!-- EMBED START Image --><figure id=\"embedded9807207\"><img src=\"//content.assets.pressassociation.io/2024/06/10105528/e9409689-32d2-47ed-a2e5-e09b92eacc2b.jpg\" alt=\"Beshtani and Hamad Al-Jehani (left) after their Epsom near miss\" srcset=\"https://content.assets.pressassociation.io/2024/06/10105528/e9409689-32d2-47ed-a2e5-e09b92eacc2b.jpg 4032w, https://content.assets.pressassociation.io/2024/06/10105528/e9409689-32d2-47ed-a2e5-e09b92eacc2b.jpg?w=320 320w, https://content.assets.pressassociation.io/2024/06/10105528/e9409689-32d2-47ed-a2e5-e09b92eacc2b.jpg?w=640 640w, https://content.assets.pressassociation.io/2024/06/10105528/e9409689-32d2-47ed-a2e5-e09b92eacc2b.jpg?w=1280 1280w\" sizes=\"(max-width: 767px) 89vw, (max-width: 1000px) 54vw, (max-width: 1071px) 543px, 580px\"><figcaption>Beshtani and Hamad Al-Jehani (left) after their Epsom near miss (PA)</figcaption></figure><!-- EMBED END Image --><p>&ldquo;It fills us full of optimism going forwards with Hamad; he&rsquo;s a great guy, has settled in really well and the early signs are hugely positive. We could not be happier.</p><p>&ldquo;He will hopefully have a couple running, Beshtani in the Hunt Cup and Make Me King in either the Buckingham Palace or the Hunt Cup.&rdquo;</p><p>Beshtani is as short as 12-1 in places for the Royal Hunt Cup, which takes place on the second day of the five-day summer showpiece. Al-Jehani has currently saddled five runners in the UK, with his next set to be Solar Aclaim at Kempton on Wednesday.</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://image.assets.pressassociation.io/v2/image/production/c310c3def016ef62fe30d95852a76793Y29udGVudHNlYXJjaGFwaSwxNzE4MDk5NjEz/2.76376021.jpg?rect=0,562,5733,3225&ext=.jpg","mimetype":"image/jpg","height":3225,"width":5733}}}}},{"uri":"b92b1ed1-dee4-4ffc-8361-ffc389e73b5d","issued":"2024-06-09T17:02:21Z","versioncreated":"2024-06-09T17:02:21Z","headline":"‘All systems go’ for Notable Speech ahead of Rosallion rematch","description_text":"William Buick: ‘I’ve been looking forward to riding him again since the Guineas.’","body_html":"<p>William Buick is relishing the next instalment of Notable Speech and Rosallion&rsquo;s one-mile rivalry when the two 2000 Guineas winners meet in the St James&rsquo;s Palace Stakes at Royal Ascot.</p><p>The Godolphin number one was the man on board Charlie Appleby&rsquo;s Newmarket hero when he showed a blistering turn of foot to account for Richard Hannon&rsquo;s charge in the opening Classic of the summer.</p><p>That race had a strong visual look to it and results since have only helped confirm that view, none more so than Rosallion gaining Classic redemption at the Curragh in the Irish equivalent.</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">City Of Troy is beaten! &#128558;</p><p>Notable Speech maintains his unbeaten record winning the QIPCO 2000 Guineas &#128165; <a href=\"https://t.co/2IxU6BpIxj\">pic.twitter.com/2IxU6BpIxj</a></p><p>&mdash; Newmarket Racecourse (@NewmarketRace) <a href=\"https://twitter.com/NewmarketRace/status/1786768701552783467?ref_src=twsrc%5Etfw\">May 4, 2024</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>Now the duo are set to clash once again on the opening day of the Royal meeting, in a race that promises to be one of the highlights of the whole week.</p><p>Buick told Racing TV: &ldquo;I&rsquo;ve been looking forward to riding him again since the Guineas and it&rsquo;s all systems go for what is possibly the race of the season, you just have to look forward to it.</p><p>&ldquo;I was impressed with Rosallion in Ireland and I thought Sean (Levey, jockey) gave him a very good ride. I thought he did well to get up when he did and he is a top-class miler, so the rematch is on.</p><p>&ldquo;I haven&rsquo;t ridden a miler that did what Notable Speech did that day in the Guineas. It was a huge performance he put in that day and you don&rsquo;t see that very often. He is hugely exciting.&rdquo;</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://image.assets.pressassociation.io/v2/image/production/ae191c392c70784bbd746d561259d566Y29udGVudHNlYXJjaGFwaSwxNzE4MDM4Mzg4/2.76066607.jpg?rect=0,263,4664,2623&ext=.jpg","mimetype":"image/jpg","height":2623,"width":4664}}}}},{"uri":"07beda0c-0210-4800-af9a-cc6e0aa0527c","issued":"2024-06-09T16:43:00Z","versioncreated":"2024-06-09T16:43:00Z","headline":"Lava Stream completes fine family double with Listed win","description_text":"Half-brother Iron Lion was on target at Haydock on Saturday.","body_html":"<p>Lava Stream may have been sent off at 14-1 for the Weatherbys/British EBF Agnes Keyser Fillies&rsquo; Stakes but trainer David O&rsquo;Meara was not surprised to see his improving filly come out on top at Goodwood.</p><p>All the talk prior to the race was about the second appearance of William Haggas&rsquo; much-vaunted Sea Just In Time, but the 1-2 favourite disappointed in sixth behind the Daniel Tudhope-ridden winner, who came home strongly to edge out Kevin Ryan&rsquo;s Bolsena by a neck.</p><p>It capped a fine weekend for owners Elwick Stud, who landed a valuable handicap at Haydock on Saturday with her half-brother Iron Lion, and the future looks bright for their daughter of Too Darn Hot, who has now won her last three.</p><p>&ldquo;It was obviously a very good win for Elwick Stud, who bred both her and her brother, who won yesterday at Haydock,&rdquo; said O&rsquo;Meara.</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">&#128168;</p><p>Lava Stream thunders home to claim Listed honours and land a hat-trick of wins for <a href=\"https://twitter.com/omeararacing?ref_src=twsrc%5Etfw\">@omeararacing</a> in the Agnes Keyser Fillies' Stakes at <a href=\"https://twitter.com/Goodwood_Races?ref_src=twsrc%5Etfw\">@Goodwood_Races</a> &#129351;</p><p>A great ride by Danny Tudhope &#128079;<a href=\"https://twitter.com/weatherbysltd?ref_src=twsrc%5Etfw\">@weatherbysltd</a> | <a href=\"https://twitter.com/BritishEBF?ref_src=twsrc%5Etfw\">@BritishEBF</a> <a href=\"https://t.co/1UqKo9Z8Rl\">pic.twitter.com/1UqKo9Z8Rl</a></p><p>&mdash; Racing TV (@RacingTV) <a href=\"https://twitter.com/RacingTV/status/1799820236780134900?ref_src=twsrc%5Etfw\">June 9, 2024</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>&ldquo;She is out of one of their very good mares and we suspected she would be good enough to get involved today, but it is great to see her win and it was a brilliant ride by Danny.</p><p>&ldquo;It wasn&rsquo;t totally unexpected and we thought she might be good enough. We&rsquo;ll take our time with her and she will improve throughout the season. She is from a lovely staying pedigree, so she is bound to improve a bit.</p><p>&ldquo;She&rsquo;s won a Listed race today, so the next thing will be to get her in a Group Three, but I will speak to the owners and see what they want to do.&rdquo;</p><p>The other Listed action on the card was the William Hill Tapster Stakes, where Charlie Appleby&rsquo;s King Of Conquest denied Roger Varian a third-straight success in the 12-furlong event.</p><p>The 11-10 favourite was partnered by William Buick, who fresh from Grade One Manhattan Stakes success at Saratoga on board Measured Time, jetted to the Sussex track to guide the five-year-old to a two-and-three-quarter lengths victory over Varian&rsquo;s Aimeric.</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://image.assets.pressassociation.io/v2/image/production/ce34cd7c2400799e12e964070bde15f7Y29udGVudHNlYXJjaGFwaSwxNzE4MDM2MTA2/2.68383146.jpg?rect=0,178,5698,3205&ext=.jpg","mimetype":"image/jpg","height":3205,"width":5698}}}}},{"uri":"97c0abec-ccc7-45c0-bdc6-f61aa5112141","issued":"2024-06-09T15:51:13Z","versioncreated":"2024-06-09T15:51:13Z","headline":"Lazzat set for Goodwood raid after fifth straight win","description_text":"Connections now eyeing Lennox or Sussex Stakes for unbeaten gelding.","body_html":"<p>Jerome Reynier&rsquo;s Lazzat could be headed to Goodwood later this summer having maintained his unbeaten record in the Prix Paul de Moussac at ParisLongchamp.</p><p>The gelded son of Territories is now unbeaten in five after successfully following up his stylish win in Deauville&rsquo;s Prix Djebel to notch up a second Group Three triumph of the season.</p><p>Despite a narrow winning margin in the French capital, he was always doing enough in the hands of Antonio Orani to hold off runner-up Havana Cigar at the finish.</p><p>Lazzat could now follow in the footsteps of Reynier&rsquo;s stable star Facteur Cheval and head to Goodwood for the Sussex track&rsquo;s big summer Festival.</p><p>&ldquo;It is amazing to keep the horse unbeaten,&rdquo; Reynier told Sky Sports Racing.</p><p>&ldquo;On his fifth start, Facteur Cheval lost his unbeaten record in Deauville, so we wanted to do better than Facteur Cheval and I hope for Lazzat he will have the same future.</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">A future Group 1 horse? &#128064;</p><p>Lazzat toughs it out to land the feature Prix Paul de Moussac for <a href=\"https://twitter.com/EcurieReynier?ref_src=twsrc%5Etfw\">@EcurieReynier</a>&hellip; <a href=\"https://t.co/NiTAPKa1K4\">pic.twitter.com/NiTAPKa1K4</a></p><p>&mdash; At The Races (@AtTheRaces) <a href=\"https://twitter.com/AtTheRaces/status/1799803419898589441?ref_src=twsrc%5Etfw\">June 9, 2024</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>&ldquo;He will probably be going to England now to Goodwood. There is the Lennox or Sussex Stakes, or we can keep him in France for the Prix Maurice de Gheest, because he won over the straight course at Deauville in the Prix Djebel. He would have to face some really good sprinters in the Prix Maurice de Gheest.&rdquo;</p><p>He went on: &ldquo;It&rsquo;s really tricky to bring a horse to the boil every two months for a big race, but we didn&rsquo;t have much choice, it was either this or the Jersey Stakes at Royal Ascot. Because he has the French premiums, financially it wasn&rsquo;t a bad move to stay in France.</p><p>&ldquo;He is a gelding so he is not eligible for the Prix Jean Prat unfortunately, so he will have to wait for England or the Prix Maurice de Gheest.&rdquo;</p><p>While British racing fans may get a glimpse of Lazzat in the very near future, the three-year-old could grace Australia with his presence later in the year if owner Nurlan Bizakov has his wish.</p><p>Reynier continued: &ldquo;He could have a big target at the end of the year and I know his owner would love to take him to Sydney for the Golden Eagle. But that is very far away and we will see after his next start how good he will really be.&rdquo;</p><p>Earlier on the card, there was an impressive display from Andre Fabre&rsquo;s Hamavi in the Listed Prix Ridgway.</p><!-- EMBED START Twitter --><figure><blockquote class=\"twitter-tweet\" data-width=\"525\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Hamavi bounces back! &#128079;</p><p>An assured performance from <a href=\"https://twitter.com/maximeguyon_off?ref_src=twsrc%5Etfw\">@maximeguyon_off</a>'s charge, who breezes past Casapueblo and Soldier's Gold for victory in the Prix Ridgway&hellip; <a href=\"https://t.co/JuIQ5vjqnq\">pic.twitter.com/JuIQ5vjqnq</a></p><p>&mdash; At The Races (@AtTheRaces) <a href=\"https://twitter.com/AtTheRaces/status/1799768775140475392?ref_src=twsrc%5Etfw\">June 9, 2024</a></p></blockquote><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></figure><!-- EMBED END Twitter --><p>The son of Dubawi was second to Prix du Jockey Club hero Look De Vega on his previous start and could have a bright future having regained the winning thread.</p><p>&ldquo;This was good and the pace was a little bit strong for my horse, but he has come through easily to win,&rdquo; said winning jockey Maxime Guyon.</p><p>&ldquo;Last time, he was just beaten by Look De Vega and we will see what he can do after. My horse is a good horse and I think it would be much better for him if he went for a more long-distance campaign.&rdquo;</p><p>Guyon registered a quick-fire double when steering Rose Jaipur to victory in the Listed Prix Melisande, while there was a shock in the Group three La Coupe, when one-time Prix de l&rsquo;Arc de Triomphe fourth Al Hakeem was denied a winning return by Carlos and Yann Lerner&rsquo;s unfancied Calif.</p>","associations":{"featureimage":{"renditions":{"16x9":{"href":"https://image.assets.pressassociation.io/v2/image/production/c4c6a8d2a5ce46721fb9c7c7605d27f5Y29udGVudHNlYXJjaGFwaSwxNzE4MDMyODE1/2.73214710.jpg?rect=0,630,4388,2468&ext=.jpg","mimetype":"image/jpg","height":2468,"width":4388}}}}}]}